[
  "TEACHER'S MANUAL FOR SOIL HEALTH ASSESSMENT PROGRAM About the Document Soil is a crucial and necessary foundation for plant growth and is a supremely important resource for our country. More than 54% of our workforce either directly depends on agriculture for their livelihood, or through allied activities. Therefore, the health of soil affects more than 54% of our workforce! Soil health is fundamental to the food system in the country. It forms the bedroc k of agriculture and serves as the vital medium for the growth of food -producing plants. When soils are healthy, they yield higher productivity of nutritious crops that provide nourishment for both humans and animals. It's important to recognize that the q uality and quantity of our food are directly connected to the quality of our soils. Therefore, prioritising soil health is essential for ensuring the availability of high -quality and abundant food for all and reducing dependency on other countries for agri cultural produce. The Honourable Prime Minister Narendra Modi has emphasised the importance of teaching students the importance of soil and its health. He has also called for senior secondary students to be trained and involved in doing soil tests to suppo rt farmers to the extent possible. This would be done by utilising school laboratories. In light of this, the Ministry of Agriculture and Farmers Welfare, the Ministry of Education, the Central Board of Secondary Education have partnered to create and curate this resource for students and teachers to be apprised of the importance of soil health and testing. This document provides teachers with information about soil, its importance in our society, its various functions and types, along with the significan ce of teaching students about soil health. This document aims to equip teachers with the knowledge about soil health and measures to improve it such that they may impart it to their students and support the efforts of soil testing to help our nation's farm ers. Contents Chapter 1: Posters for Students ................................ ................................ ................................ .............. 1 Poster 1 - Students for soil, let's cultivate and revive ................................ ................................ ............. 1 Poster 2 - Soil & Agriculture in India ................................ ................................ ................................ ....... 3 Poster 3 - Soil health card ................................ ................................ ................................ ....................... 5 Poster 4: Learning together with Farmers ................................ ................................ .............................. 7 Poster 5 - Type of Soils ................................ ................................ ................................ ............................ 9 Chapter 2: Introduction to Soil ................................",
  "our nation's farm ers. Contents Chapter 1: Posters for Students ................................ ................................ ................................ .............. 1 Poster 1 - Students for soil, let's cultivate and revive ................................ ................................ ............. 1 Poster 2 - Soil & Agriculture in India ................................ ................................ ................................ ....... 3 Poster 3 - Soil health card ................................ ................................ ................................ ....................... 5 Poster 4: Learning together with Farmers ................................ ................................ .............................. 7 Poster 5 - Type of Soils ................................ ................................ ................................ ............................ 9 Chapter 2: Introduction to Soil ................................ ................................ ................................ ............. 11 What is Soil & its Composition? ................................ ................................ ................................ ........ 11 Importance of Soils to Agriculture ................................ ................................ ................................ .... 12 Chapter 3: Issues of Soil Health ................................ ................................ ................................ ............ 14 Basics of Soil health ................................ ................................ ................................ ........................... 14 Present day challenges of Soil health and Fertility ................................ ................................ ........... 16 The imbalance in the use of fertilizers ................................ ................................ .............................. 16 Impact of Human interference on soil health ................................ ................................ ................... 17 Chapter 4: Soil fertility indicators and soil Health in agriculture ................................ .......................... 19 Percent soil Organic Carbon: ................................ ................................ ................................ ............ 19 Soil pH ................................ ................................ ................................ ................................ ............... 19 Electrical Conducti vity (EC) ................................ ................................ ................................ ............... 20 Available Nutrients ................................ ................................ ................................ ............................ 20 Major nutrients ................................ ................................ ................................ ................................ . 20 Chapter 5: Objectives of Soil Health Program ................................ ................................ ...................... 22 Chapter 6: Soil Health Assessment Methods ................................ ................................ ........................ 25 Overview of Soil Health Card (SHC) ................................ ................................ ................................ .. 25 SOPs for Soil Sampling & Processing of Sample for Testing ................................ ............................. 26 Do's and Don'ts for soil sampling, processing & testing in Indian conditions: ................................ . 30 Soil Testing & Analysis ................................ ................................ ................................ ...................... 32 Digital Soil Testing Mini Lab/ PUSA STFR machine ................................ ................................ ........... 32 Significance of Digital Soil Testing Mini Lab/ PUSA SFTR machine ................................ ................... 33 Using the Soil Testing kit (Do's and don'ts for soil testing using a soil testing kit) ........................... 33 Chapter 7: Data analysis and interpretation for S oil Samples Analysis Using Digital Soil Testing Mini Lab/ PUSA SFTR machine ................................ ................................ ................................ ...................... 35 Experiment I - Estimation of Soil pH ................................ ................................ ................................ .. 35 Experiment II - Estimation of Electrical Conductivity of soil ................................ .............................. 36 Experiment III - Estimation of Soil Organic Carbon ................................ ................................ ............ 37 Experiment IV - Estimation of Soil Available Nitrogen ................................ ................................ ....... 38 Experiment V",
  "soil testing kit) ........................... 33 Chapter 7: Data analysis and interpretation for S oil Samples Analysis Using Digital Soil Testing Mini Lab/ PUSA SFTR machine ................................ ................................ ................................ ...................... 35 Experiment I - Estimation of Soil pH ................................ ................................ ................................ .. 35 Experiment II - Estimation of Electrical Conductivity of soil ................................ .............................. 36 Experiment III - Estimation of Soil Organic Carbon ................................ ................................ ............ 37 Experiment IV - Estimation of Soil Available Nitrogen ................................ ................................ ....... 38 Experiment V - Estimation of Soil Phosphorus ................................ ................................ .................. 39 Experiment VI - Estimation of Soil Potassium ................................ ................................ .................... 41 Experiment VII - Estimation of Sulphur content in soil ................................ ................................ ...... 44 Experiment VIII - Estimation of Zinc content in soil ................................ ................................ ........... 46 Experiment IX - Estimation of Iron content in soil ................................ ................................ ............. 47 Experiment X - Estimation of Copper content in soil ................................ ................................ ......... 48 Experiment XI - Estimation of Manganese content in soil ................................ ................................ . 49 Experiment XII - Estimation of Boron content in soil ................................ ................................ ......... 50 Chapter 8: Assessment and Evaluation ................................ ................................ ................................ . 51 Interpretation of Results ................................ ................................ ................................ ................... 51 Soil pH ................................ ................................ ................................ ................................ ............... 51 Soil EC ................................ ................................ ................................ ................................ ................ 52 Soil Organic Carbon (OC) ................................ ................................ ................................ ................... 52 Nitrogen ................................ ................................ ................................ ................................ ............ 53 Phosphorus ................................ ................................ ................................ ................................ ....... 53 Potassium ................................ ................................ ................................ ................................ .......... 53 Sulphur ................................ ................................ ................................ ................................ .............. 54 Micro -nutrients, i.e., Zinc, Iron, Copper, Manganese, Boron ................................ ........................... 54 Conversion Factor to Multiply Soil Testing Value to Get STL Value ................................ .................. 54 Recommended Dose of Fertilizers (RDF) ................................ ................................ .......................... 55 Chapter 9: SOPs for use of a mobile app for soil sample collection, laboratory analysis, and soil health card generation in Indian soil ................................ ................................ ................................ ............... 56 1 Chapter 1: Posters for Students Poster 1 - Students for soil, let's cultivate and revive 2 • The poster can be shared to draw the attention of students to the Soil Health Card program in school labs. The poster focuses on the importance of the Soil Health Card program in school labs and highlights the significance of soil health, the current situa tion of soil erosion and desertification, and the outcomes of the program. • The poster highlights the objective and need of the Soil Health Card program",
  "Students for soil, let's cultivate and revive 2 • The poster can be shared to draw the attention of students to the Soil Health Card program in school labs. The poster focuses on the importance of the Soil Health Card program in school labs and highlights the significance of soil health, the current situa tion of soil erosion and desertification, and the outcomes of the program. • The poster highlights the objective and need of the Soil Health Card program in school labs. The objective of this program is to encourage hands -on scientific enquiry on soil para meters such as nutrient content, soil pH, and organic matter. By studying these aspects of soil, we can learn more about how to cultivate it in a better way. It also helps us to develop a sense of responsibility towards sustainable agricultural practices a nd builds environmental awareness among us. • The poster also highlights the importance of soil health. Healthy soil is a finite and precious resource that takes centuries to develop. It plays a critical role in sustainable food production. Without healthy soil, it would be difficult to grow the crops we rely on for our food. In addition, soil provides us with environmental benefits like biodiversity and carbon storage, which are essential for a balanced ecosystem. • Explain the current situation of s oil erosion and soil desertification in our country is a matter of concern. Around 30% of India's geographical area is affected by degradation, and 29.32% is undergoing desertification. Share the statistics given in the poster and indicate the students tha t we need to take immediate action to protect and improve our soil. • After this discussion, share the expected outcomes of the Soil Health Card program. Explain to the students that when they learn more about soil health, they can promote deeper agricultur al knowledge and can make informed decisions on how to take care of our soil. This program will help us develop a sense of environmental stewardship amongst students, which means taking responsibility for protecting and conserving our natural resources. By building a greener and more sustainable future, we can ensure that our planet thrives. In conclusion, the poster must be leveraged to motivate and inspire students to become \"soil heroes\" and care for the planet. 3 Poster 2 - Soil & Agriculture in I ndia 4 • The poster provides students valuable",
  "of our soil. This program will help us develop a sense of environmental stewardship amongst students, which means taking responsibility for protecting and conserving our natural resources. By building a greener and more sustainable future, we can ensure that our planet thrives. In conclusion, the poster must be leveraged to motivate and inspire students to become \"soil heroes\" and care for the planet. 3 Poster 2 - Soil & Agriculture in I ndia 4 • The poster provides students valuable information about the significance of soil and agriculture in our country. It is important to discuss the statistics given in the poster highlighting the extensive agricultural activity taking place in our country. • The chart shows us the distribution of farm holdings among individuals. The majority, approximately 68.45%, fall under the category of marginal holdings, which means they own up to 1 hectare of land. Around 17.62% fall under small holdings, o wning 1 -2 hectares of land. The remaining 13.93% fall into the category of others, who own more than 2 hectares of land. With this information, students can recognise the different types of farm holdings in India. • The poster draws attention to the presen ce of chemicals in the food chain highlighting the need to reduce chemical usage in agriculture for healthier food production. Through the poster we can reiterate the importance of exploring sustainable and organic farming practices to ensure the safety of our food. • Moving on, the poster also discusses the global condition of soil erosion and desertification in comparison to India's context. The significant challe nges that these issues pose on food production must be addressed with students to make them aware of how crucial it is to protect our soil and combat erosion and desertification. • The poster also highlights the contribution of agriculture to our GDP. The agriculture sector employs over 50% of the total workforce in India, demonstrating its importance in providing livelihoods. Furthermore, agriculture contributes around 20% of our country's Gross Domestic Product value. This shows how agriculture plays a vit al role in our economy. • The next point mentioned is about India's agro -climatic conditions. The country is divided into 15 broad agro -climatic zones based on factors such as physiography, soils, geological formation, climate, and cropping patterns. These zones help in planning agricultural activities and developing future strategies to optimize agricultural productivity. • Discuss the major",
  "in providing livelihoods. Furthermore, agriculture contributes around 20% of our country's Gross Domestic Product value. This shows how agriculture plays a vit al role in our economy. • The next point mentioned is about India's agro -climatic conditions. The country is divided into 15 broad agro -climatic zones based on factors such as physiography, soils, geological formation, climate, and cropping patterns. These zones help in planning agricultural activities and developing future strategies to optimize agricultural productivity. • Discuss the major food grains and cereals produced in our country. It showcases categories such as rice, wheat, nutri/coarse cereals, ma ize, barley, pulses (such as gram and moong), and oilseeds (including groundnut, soybean, and rapeseed & mustard). These food items are essential for our sustenance and play a vital role in our diet. This discussion will also further strengthen the student ’s understanding of the importance of soil and agriculture in our country. 5 Poster 3 - Soil health card 6 • The poster is to help students know more about the Soil Health Card (SHC) program and its objective of promoting Integrated Nutrient Management (I NM) for improving soil health and productivity. • The program aims to improve soil health and productivity through the judicious use of chemical fertilizers, organic manures, and biofertilizers. Integrated Nutrient Management (INM) is the approach used to achieve this goal. INM emphasizes the balanced and efficient use of nutrients to ensure sustainable agriculture. • The sub -components of the SHC scheme are also mentioned in the poster. These include setting up or strengthening Soil Testing Labs, Quality Co ntrol Labs for fertilizers, bio -fertilizers, and organic fertilizers. It is important to create awareness about this as the labs play a crucial role in analysing soil samples and providing farmers with essential information about their soil's nutrient stat us and recommended nutrient dosage. This helps farmers make informed decisions regarding fertilizers and other inputs. • The objectives of implementing INM and promoting soil health are then explained. Here teachers can discuss with students how adopting I NM practices, farmers can achieve higher yields while maintaining the long -term health of their land and the soil structure, nutrient holding capacity, and water - holding capacity can also be simultaneously improved. • Furthermore, the poster highlights the importance of minimizing environmental pollution caused by excess fertilizer use. Here, the students must be made aware of other components of INM",
  "of implementing INM and promoting soil health are then explained. Here teachers can discuss with students how adopting I NM practices, farmers can achieve higher yields while maintaining the long -term health of their land and the soil structure, nutrient holding capacity, and water - holding capacity can also be simultaneously improved. • Furthermore, the poster highlights the importance of minimizing environmental pollution caused by excess fertilizer use. Here, the students must be made aware of other components of INM such as organic manures and biofertilizers. These natural inputs enrich the soil, improve its fertility, and promote a healthy and sustainable farming system. • The message on the poster, \"Let us join hands to support every farmer,\" is a call for collective action for students. It emphasizes the importance of supporting our farmers in their efforts to improve soi l health and productivity. 7 Poster 4: Learning together with Farmers 8 • It is important to discuss this poster with students as it emphasizes the importance of schools and students in supporting local farmers and promoting sustainable agriculture practices. It is important for students to understand their role in supporting lo cal farmers. • The poster highlights that students can make a significant difference by actively engaging in activities that promote and understand sustainable agriculture practices. They can do so by participating in hands -on activities like community kitchen gardens and fields. Teachers can ensure that by getting involved in these activities, they not only learn about food production but also experience the joy of growing our own food. This will help in developing a deeper appreciation for the effort and hard work that goes into producing the food we consume. • The poster also encourages us to organize farm visits. These visits allow them to connect with farmers and gain a better understanding of the challenges they face in agriculture. It will also foster respect and empathy towards their profession while creating a strong bond between students and farmers. • Another way we can support local farmers is by promoting farmer markets. These markets provide a platform for farmers to directly sell their produce to the community. By purchasing fresh, locally grown produce from these markets, we not only support the farmers financially but also benefit from healthier and more sustainable food options. • The poster also includes infographics and pictures that demonstra te the process of soil testing.",
  "profession while creating a strong bond between students and farmers. • Another way we can support local farmers is by promoting farmer markets. These markets provide a platform for farmers to directly sell their produce to the community. By purchasing fresh, locally grown produce from these markets, we not only support the farmers financially but also benefit from healthier and more sustainable food options. • The poster also includes infographics and pictures that demonstra te the process of soil testing. These visuals will help students understand how soil testing is done and its importance in ensuring healthy crop growth. With this information they can help farmers make informed decisions regarding fertilizers and other inp uts. In conclusion, the poster highlights the need for collective effort and promotes sustainable agriculture practices to contribute to a stronger and more resilient agricultural sector. 9 Poster 5 - Type of Soils 10 • The poster provides valuable information about the various types of soil found in India and their association with specific regions and natural vegetation. Each type of soil is found in specific regions of the country and has distinct characteristics. By s tudying soil types and their characteristics, students can also learn how to adapt our farming practices accordingly. • Different types of soil require different approaches for sustainable agriculture and land management. This knowledge is important for farmers, policymakers, and environmentalists to make informed decisions and preserve the fertility and health of our soil. • By making students understand and appreciate the diversity of soil types, teachers can discuss how they can contribute to sustainable land management practices and ensure the long -term productivity and health of our soil. Students can be encouraged to learn more about the soil and vegetation present in their respective regions. 11 Chapter 2: Introduction to Soil What is Soil & its Composition ? Soil is a mixture of minerals and organic material that covers much of Earth’s surface. Minerals are bits of rock, and organic material is the remains of living things that have died. Soil provides the structural support to plants for growing crops under agriculture lands and is their source of water and nutrients . Soils varies in their chemical and physical properties. Processes such as lea ching, weathering and microbial activity combine to make a whole range of different soil types . Composition of soil: The arrangement and distribution of soil components",
  "of Earth’s surface. Minerals are bits of rock, and organic material is the remains of living things that have died. Soil provides the structural support to plants for growing crops under agriculture lands and is their source of water and nutrients . Soils varies in their chemical and physical properties. Processes such as lea ching, weathering and microbial activity combine to make a whole range of different soil types . Composition of soil: The arrangement and distribution of soil components vary as per soil types. There are mainly four types of soil : 12 Twelve major soil texture classifications are defined by the United States, Department of Agriculture as shown alongside – Percent p roportions of sand, silt and clay will determine the type of textural classes. Importance of Soil s to Agriculture • Agriculture is one of the most important economic components of our society. • Soil being finite in nature and precious resource for agriculture as it provides the structural support to crops in agriculture and is also their source of water and nutrients in nearly 45.27% percent of reported geographic area under agriculture in the country ( 140 million ha) in the country. • India hugely depends on agriculture for its economy which support livelihood of 50% population. • Agriculture sector employs over 50% of the total workforce in the country and Responsible for 20% of the country’s Gross Domestic Product Value. • Healthy soil plays a critical in successful agriculture in terms of providing foods; fodder with environmental benefits of biodiversity and carbon storage required for effective functioning of ecosystem services and is the original source of the nutrients that we use to grow crops 13 • Soil being finite in nature and requires 200 -400 years to develop 1cm of soil layer. Only h ealthy soil Provide medium for plants use soil nutrients, and when they die, microorganisms decompose their remains . Thus, soil provide base for nutrients cycle to operate effectively • The healthiest soils produce the healthiest and most abundant food supplies, so for getting unabated food supply without compromising soil health, monitoring of soil health is present day reality. In nature, plants use soil nutrients, and then they die and are decomposed by microorganisms. This retur ns the nutrients to the soil. 14 Chapter 3: Issues of Soil Health Basics of Soil health Soil health corresponds to the state of the soil",
  "base for nutrients cycle to operate effectively • The healthiest soils produce the healthiest and most abundant food supplies, so for getting unabated food supply without compromising soil health, monitoring of soil health is present day reality. In nature, plants use soil nutrients, and then they die and are decomposed by microorganisms. This retur ns the nutrients to the soil. 14 Chapter 3: Issues of Soil Health Basics of Soil health Soil health corresponds to the state of the soil being in sound physical, chemical, and biological condition, having the capability to sustain the growth and development of land plants. It is the sustained ability of soil to produce crops and supply, retention and infiltration of water, habitat for diverse organisms, and recycling of nutrients. In the recent past, s oil health is continuing to gain importance am ong farmers, scientists and planners world over for implementation of programs on sustainable agriculture development. While awareness of soil health is increasing, it is important to have a good understanding of what soil health, how it is measured, and h ow to manage it for optimal and sustainable delivery of the ecosystem services that soils provide. Just as we can take differ ent measurement to judge a person ’s health, it is also possible to measur e specific soil properties to detect whether a soil is healthy or not. Such measurements may be quantitativ e or qualitative, or a combination of both. In India presently under Soil Health Card Scheme 12 parameters are measured. They are Soil primary nutrients (N, P, K), Soil Seconda ry nutrients (S), Soil micronutrients (Zn, Fe, CU, Mn, B), Soil salinity (EC), Soil pH and Soil Organic Carbon. The critical situation of soil health status with respect to agriculture 15 The critical situation of soil health status with respect to agriculture is a significant concern worldwide. Here are some details regarding this issue: 1. Soil Degradation: Soil degradation is a primary concern affecting soil health. Factors such as erosion, nutrient depletion, compaction, salinization, and acidification contribute to the deterioration of soil quality. Unsustainable agricultural practices, defore station, urbanization, and climate change exacerbate these issues. 2. Nutrient Depletion: Continuous cultivation without adequate nutrient replenishment can lead to nutrient depletion in the soil. Nutrients essential for plant growth, such as nitrogen, ph osphorus, and potassium, are gradually depleted, resulting in reduced crop yields. Inadequate nutrient management, excessive use of",
  "degradation is a primary concern affecting soil health. Factors such as erosion, nutrient depletion, compaction, salinization, and acidification contribute to the deterioration of soil quality. Unsustainable agricultural practices, defore station, urbanization, and climate change exacerbate these issues. 2. Nutrient Depletion: Continuous cultivation without adequate nutrient replenishment can lead to nutrient depletion in the soil. Nutrients essential for plant growth, such as nitrogen, ph osphorus, and potassium, are gradually depleted, resulting in reduced crop yields. Inadequate nutrient management, excessive use of synthetic fertilizers, and poor organic matter management contribute to this problem. 3. Acidification and Salinization: When soil pH dropping below optimal levels for plant growth. Acidification can result from excessive use of chemical fertilizers, acid rain etc. Whereas s alinization occurs when the salt content in the soil increases to harmful levels due o ver-irrigation, po or drainage, and the use of low -quality water sources . It reduces the availability of water to plants and negatively affects their growth and productivity. 4. Loss of Organic Matter: Organic matter provides essential nutrients, improves soil structure, an d enhances moisture retention capacity. However, unsustainable farming practices, including excessive tillage, removal of crop residues, and lack of organic inputs, lead to a decline in organic matter content. Loss of organic matter reduces soil fertility and resilience. 5. Pollution and Contamination: Agricultural activities often involve the use of pesticides, herbicides, and fertilizers. Improper application and excessive use of these chemicals can result in soil pollution and contamination. Chemical re sidues in the soil can harm soil organisms, beneficial insects, and potentially enter the food chain, posing risks to human health and the environment. 16 Addressing these critical issues requires implementing sustainable agricultural practices, such as conservation tillage, crop rotation, agroforestry, cover cropping, and precision agriculture. These practices aim to minimize soil erosion, promote nutrient cycling, enhance soil structure, and reduce chemical inputs, thereby improving soil health and ensu ring long -term agricultural sustainability. Present day challenges of Soil health and Fertility Soil fertility is inherent ability of soils to provide nutrient to plants in available forms. It is a fundamental aspect of soil health. Together significance of soil fertility and soil health for sustainable agriculture lies in its ability to support resilient and productive cropping systems while preserving natural resources. By focusing on soil fertility farmer can improve soil health, and their crop yields, improve the nutritiona l quality of their produce, reduce",
  "Present day challenges of Soil health and Fertility Soil fertility is inherent ability of soils to provide nutrient to plants in available forms. It is a fundamental aspect of soil health. Together significance of soil fertility and soil health for sustainable agriculture lies in its ability to support resilient and productive cropping systems while preserving natural resources. By focusing on soil fertility farmer can improve soil health, and their crop yields, improve the nutritiona l quality of their produce, reduce environmental impacts, and contribute to a more sustainable and resilient food system . Today , Soil health being compromised due following factors The imbalance in the use of fertilizers The use of fertilizers and its impact on Indian soils is a significant concern that affects soil health and agricultural sustainability in following way. 1. Excessive Use of Chemical Fertilizers: In India, there has been a tendency towards excessive and i mbalanced use of chemical fertilizers, particularly nitrogen (N), phosphorus (P), and potassium (K). Farmers often apply fertilizers based on crop yield targets without considering the soil's nutrient requirements for crop . This imbalanced application lead s to nutrient overdosing in the soil. 2. Nutrient Imbalance: The excessive use of chemical fertilizers, especially nitrogen and phosphorus, while neglecting other essential nutrients, causes nutrient imbalances in the soil. Imbalances can result in defici encies or toxicities of certain nutrients, negatively affecting crop growth and yield. Over time, these imbalances lead to soil degradation and reduced fertility. 3. Soil Degradation and Reduced Fertility: The imbalanced use of fertilizers contributes to soil degradation and reduced fertility. Excessive nitrogen application can lead to 17 nutrient leaching, as well as the loss of soil organic matter. Phosphorus overuse can result in phosphorus fixation, making it less available to plants. These factors collec tively degrade soil quality, decrease nutrient -holding capacity, and reduce overall soil fertility. 4. Environmental Impact: The excessive use of chemical fertilizers in India has environmental consequences beyond soil degradation. Manufacturing and trans portation of fertilizers contribute to greenhouse gas emissions, air pollution, and energy consumption. Furthermore, the pollution caused by nutrient runoff from agricultural fields affects water quality and aquatic ecosystems, impacting biodiversity and h uman health. 5. Addressing the imbalance in fertilizer use requires a shift towards balanced nutrient management practices. This includes soil testing to determine nutrient requirements, adopting site -specific nutrient management (SSNM) techniques, promot ing organic farming and the",
  "has environmental consequences beyond soil degradation. Manufacturing and trans portation of fertilizers contribute to greenhouse gas emissions, air pollution, and energy consumption. Furthermore, the pollution caused by nutrient runoff from agricultural fields affects water quality and aquatic ecosystems, impacting biodiversity and h uman health. 5. Addressing the imbalance in fertilizer use requires a shift towards balanced nutrient management practices. This includes soil testing to determine nutrient requirements, adopting site -specific nutrient management (SSNM) techniques, promot ing organic farming and the use of organic fertilizers . Government policies, farmer education programs, and subsidies that promote sustainable fertilizer use and awareness about nutrient management can play a crucial role in mitigating the adverse impacts on Indian soils and fostering sustainable agriculture. Impact of Human interference on soil health Human interference has a significant impact on soil health and can lead to various forms of soil degradation. Here are some ways in which human acti vities affect soil: 1. Deforestation: Clearing forests for agriculture, urbanization, or urban planning disrupts the natural ecosystem and exposes the soil to erosion. Tree roots help bind the soil together, and their removal increases the risk of soil er osion, leading to loss of topsoil and decreased fertility. 2. Unsustainable Agriculture Practices: Intensive and unsustainable agricultural practices contribute to soil degradation. Excessive tillage, overuse of chemical 18 fertilizers and pesticides, monocr opping, and improper flood irrigation can lead to soil erosion, nutrient depletion, compaction, and loss of organic matter. 3. Urbanization and Construction: Urban development involves clearing land, compacting soil, and covering it with impermeable surfaces such as concrete and asphalt. This reduces soil's ability to absorb and retain water, disrupts natural drainage patterns, and reduces soil fertility. 4. Industrial Activities and Pollution: Industrial activities release pollutants int o the environment, including heavy metals, chemicals, and toxins. These pollutants can contaminate the soil, making it unsuitable for agriculture. Industrial waste disposal, improper handling of hazardous materials, and industrial accidents can lead to soi l pollution. 5. Improper Waste Disposal: Improper disposal of solid waste, including plastics, heavy metals, and organic waste, can lead to soil pollution. Landfills and waste disposal sites that are not properly designed and managed can contaminate the surrounding soil, groundwater, and ecosystems. 6. Climate Change: Human -induced climate change, primarily through increased greenhouse gas emissions, affects soil health. Rising temperatures, changes in precipitation patterns, and extreme weather events can intensify soil erosion, alter nutrient",
  "accidents can lead to soi l pollution. 5. Improper Waste Disposal: Improper disposal of solid waste, including plastics, heavy metals, and organic waste, can lead to soil pollution. Landfills and waste disposal sites that are not properly designed and managed can contaminate the surrounding soil, groundwater, and ecosystems. 6. Climate Change: Human -induced climate change, primarily through increased greenhouse gas emissions, affects soil health. Rising temperatures, changes in precipitation patterns, and extreme weather events can intensify soil erosion, alter nutrient cycles, and impact microbial activity in the soil. To mitigate the negative impacts of human interference on soil, sustainable land management practices need to be adopted. These include conservati on agriculture, agroforestry, organic farming, proper waste management, reforestation, erosion control measures, and responsible land -use planning. Additionally, educating and raising awareness among individuals, farmers, and industries about the importanc e of soil conservation and sustainable practices can help preserve soil health for future generations. 19 Chapter 4: Soil fertility indicators and soil Health in agriculture The soil fertility attributes or indicators are interconnected and their status in soils positively and negatively impacts the functioning within the soil -plant system. They collectively contribute to the overall health and productivity of the soil. Understanding of these attributes are vital for s ustainable agriculture, as they help optimize nutrient availability, promote plant growth, and support environmental stewardship. Soil health assessment incorporating these attributes enables farmers to make informed decisions regarding soil management pra ctices, nutrient application, and crop rotation, ultimately contributing to sustainable agricultural systems. Percent soil Organic Carbon: • Organic carbon is a measure of the amount of organic matter present in the soil. It originates from decomposed plant and animal residues. • Organic carbon contributes to soil health by enhancing soil structure, water - holding capacity, and nutrient cycling. It promotes beneficial microbial activity. • Adequate organic carbon content is essential for support ing plant growth, nutrient availability, and overall soil health . Soil pH • Soil pH is a measure of soil acidity or alkalinity. It influences nutrient availability and microbial activity in the soil. • Different plants have different pH preferences, and soil pH affects nutrient solubility and uptake by plant roots. • Maintaining the appropriate soil pH range for specific crops helps optimize nutrient availability and prevents nutrient deficiencies or toxicities. 20 Electrical Conductivity (EC) • EC is a measure of the soil's ability to conduct electrical current",
  "health . Soil pH • Soil pH is a measure of soil acidity or alkalinity. It influences nutrient availability and microbial activity in the soil. • Different plants have different pH preferences, and soil pH affects nutrient solubility and uptake by plant roots. • Maintaining the appropriate soil pH range for specific crops helps optimize nutrient availability and prevents nutrient deficiencies or toxicities. 20 Electrical Conductivity (EC) • EC is a measure of the soil's ability to conduct electrical current and indicates the concentration of soluble salts in the soil. • High EC levels can indicate soil salinity, which can negatively impact plant growth and restrict nutrient u ptake. • Monitoring EC helps in assessing soil salinity and determining appropriate management practices, such as leaching to reduce salt accumulation. Available Nutrients • Soil nutrients, including macro - and micronutrients, are essential for plant growth a nd development. • Nutrient availability in the soil depends on factors such as organic matter decomposition, pH, and nutrient cycling processes. • Adequate nutrient levels are crucial for plant growth, productivity, and overall crop quality. • Soil testing and analysis help determine the levels of available nutrients, enabling farmers to adjust fertilization practices and address nutrient imbalances There and major and micro nutrients based on its quantitative requirement are been categorised and th ese are as under : Major nutrients a) Nitrogen (N): Nitrogen is essential for plant growth and plays a vital role in protein synthesis, leaf development, and overall plant vigour . However, excessive nitrogen use can lead to environmental issues such as water pollution and greenhouse gas emissions. 21 b) Phosphorus (P): Phosphorus is crucial for energy transfer, root development, and fruiting in plants. Phosphorus availability in the soil supports healthy crop establishment, enhances root growth, and improves crop quality. c) Potassium (K): Potassium is involved in numerous physiological processes in plants, including enzyme activation, and nutrient transport. It contributes to disease resistance, water use efficiency, and enhances tolerance to stress conditions . Micronutrients a) Iron (Fe): Iron is crucial for chlorophyll synthesis and plays a key role in photosynthesis and energy production in plants . Iron deficiency can lead to yellowing of leaves (chlorosis) and reduced crop productivity. b) Zinc (Zn): Zinc is involved in various enzyme activities and plays a critical role in plant hormone production, protein synthesis, and carbohydrate metabolism. Zinc deficiency can lead to stunted growth, reduced yields,",
  "resistance, water use efficiency, and enhances tolerance to stress conditions . Micronutrients a) Iron (Fe): Iron is crucial for chlorophyll synthesis and plays a key role in photosynthesis and energy production in plants . Iron deficiency can lead to yellowing of leaves (chlorosis) and reduced crop productivity. b) Zinc (Zn): Zinc is involved in various enzyme activities and plays a critical role in plant hormone production, protein synthesis, and carbohydrate metabolism. Zinc deficiency can lead to stunted growth, reduced yields, and impaired nutrient uptake. c) Manganese (Mn): Mangane se is essential for photosynthesis, enzyme activation, and nitrogen metabolism in plants. Manganese deficiency can lead to yellowing between veins (interveinal chlorosis) and reduced crop yields. d) Copper (Cu): Copper is involved in several metabolic proce sses, including photosynthesis, respiration, and lignin synthesis. It contributes to plant reproductive development, disease resistance, and enzyme activity. Copper deficiency can result in wilting, leaf deformities, and reduced crop yields. Similarly, fertile soil contains an optimal balance of essential nutrients necessary for plant growth, such as nitrogen, phosphorus, potassium, and micronutrients. Maintaining soil fertility is essential to support healthy crop development, high yields, and nutrient -rich food production. 22 Chapter 5: Objectives of Soil Health Program The objective of a student awareness program on soil health assessment using farmer soil testing and laboratory analysis program may aim to achieve: 1. Understanding Soil Health : The program seeks to enhance students' understanding of soil health and its importance in agriculture. It aims to familiarize them with the concept of soil health, its components, and how it influences plant growth, productivity, and sustainability. 2. Practical Experience in Soil Testing : The program provides students with hands -on experience in conducting soil testing. It aims to equip them with the skills and knowledge to collect soil samples, perform basic laboratory tests, an d interpret the results for assessing soil health parameters. 3. Awareness of Sustainable Soil Management: The program aims to raise awareness among students about the significance of sustainable soil management practices. It educates them about the benefit s of soil conservation, nutrient management, organic amendments, and other practices that improve soil health and support long -term agricultural sustainability. 23 4. Collaboration with Farmers: The program fosters collaboration and engagement between students and farmers. It aims to encourage students to work alongside farmers, learn from their experiences, and assist them in assessing and managing soil health using farmer",
  "aims to raise awareness among students about the significance of sustainable soil management practices. It educates them about the benefit s of soil conservation, nutrient management, organic amendments, and other practices that improve soil health and support long -term agricultural sustainability. 23 4. Collaboration with Farmers: The program fosters collaboration and engagement between students and farmers. It aims to encourage students to work alongside farmers, learn from their experiences, and assist them in assessing and managing soil health using farmer field soil testing methods. 5. Promoting Environmental Stewardship: The program aims to i nstill a sense of environmental stewardship in students. It emphasizes the importance of soil conservation, minimizing soil erosion, and preventing nutrient runoff to protect water quality and preserve ecosystems. 6. Knowledge Transfer to the Community : The program aims to empower students as ambassadors of soil health awareness. It encourages them to share their knowledge with farming communities, promoting the adoption of sustainable soil management practices among farmers, neighbours, and other stakeholde rs. 7. Inspiring Future Agricultural Leaders: The program aims to inspire students to consider careers or further studies in agriculture, soil science, or related fields. It aims to foster their interest in sustainable agriculture, soil conservation, 24 and en vironmental sciences, nurturing the next generation of agricultural leaders and innovators. By addressing these objectives, a student awareness program on soil health assessment using farmer soil testing and laboratory analysis can help raise awareness, build skills, and inspire students to become advocates for sustainable soil management practices and guardians of our precious soil resources. 25 Chapter 6: Soil Health Assessment Methods Overview of Soil Health Card (SHC) Government of India has started a scheme “National Mission for Sustainable Agriculture” and Soil Health Management (SHM) is one of the most important interventions under this scheme. SHM aims to promote crop specific sustainable soil health management and judicious application of fertilizers. Keeping this in view, Ministry of Agriculture and Farmers’ Welfare introduced the Soil Health Card (SHC) scheme on 19th February 2015 so as to provide a basis to address nutritional deficiencies in fertilization practices. Under this scheme, 12 soil health parameters are analysed and soil health card, a printed report are generated which contains nutrient status of soil with respect to 12 nutrients as listed below: A Soil Health Card provides the information for the nutrient status of soil, along with recommendations on the dosage of nutrients",
  "and Farmers’ Welfare introduced the Soil Health Card (SHC) scheme on 19th February 2015 so as to provide a basis to address nutritional deficiencies in fertilization practices. Under this scheme, 12 soil health parameters are analysed and soil health card, a printed report are generated which contains nutrient status of soil with respect to 12 nutrients as listed below: A Soil Health Card provides the information for the nutrient status of soil, along with recommendations on the dosage of nutrients to be utilized for improving its fertility and health. SHC enables the farmers to apply recommended doses of nutrients based on soil test values to realize improved and sustainable soil health and fertility, low cos ts and higher profits. 26 SOPs for Soil Sampling & Processing of Sample for Testing When to Sample? Timing of sampling is important because soil properties vary depending on the time of year and type of management practices used, such as tillage or nutrient application just prior to testing. The best time of year to sample is when the climate is most stable and there have been no recent disturbances, such as after harvesting or at the end of the growing season. Where to Sample? 1. For sampling of micronutrient analysis, always use auger made up of stainless steel instead of rusted iron khurpi or spade. 2. Store soil samples in clean cloth or polythene bags. 3. Use glass or polythene jars for storage of soil samples for a longer duration. 4. Recently fertilized plots, bunds, channels, marshy tracts, area near trees, farm ways, buildings, wells, compost piles or other non -representative locations must be avoided during sampling. Sample of Soil Health Card 27 Basic soil sampling tools Soil sampling tools are required to collect a uniform amount of soil at any given depth. Various kinds of soil sampling tools are used/ recommended for the soil to be sampled in different environments. Some of the basic soil sampling tools u sed are as shown below - Depth of soil sampling Collection of soil samples There are methods/ technique for collection of soil samples which vary according to the purpose of sampling and a number of approaches may be employed. The two techniques, i.e., Grid sampling & Zig -zag sampling are shown below – S. No. Type of situation/ crop Depth of sampling 1. Cereals, vegetables, seasonal crops etc. (Shallow rooted crops) All soil types under",
  "basic soil sampling tools u sed are as shown below - Depth of soil sampling Collection of soil samples There are methods/ technique for collection of soil samples which vary according to the purpose of sampling and a number of approaches may be employed. The two techniques, i.e., Grid sampling & Zig -zag sampling are shown below – S. No. Type of situation/ crop Depth of sampling 1. Cereals, vegetables, seasonal crops etc. (Shallow rooted crops) All soil types under cultivation 0-15 cm Furrow slice layer 2. Deep rooted crops with longer duration (Cotton, sugarcane, banana, tapioca, vegetables etc.) Plantation or fruit crops Samples should be collected from different depth depending on situation 28 Grid sampling allows for a systematic, non-random , approach to soil sampling which can be applied on a whole or for sampling relatively smaller areas. It allows for a higher degree of precision where repeat samples are collected over time. Zig-zag sampling provides the best coverage of an area if care is taken with the sample collection. This is often the best strategy for collecting samples to diagnose nutrient deficiencies. V-shaped soil sampling (15 cm soil sampling depth) Procedure of V shaped method of soil sampling: 1.Remove the surface litter, grass, debris, etc., from the sampling point 2.Drive the auger to a plough depth of 15 cm and draw the soil sample 3.Collect at least 10 to 15 samples from each sampling unit and p lace in a bucket or tray 4.If auger is not available, make a ‘V’ shaped cut to a depth of 15 cm in the sampling spot using spade 5. Remove thick slice of soil from top to bottom of exposed face (2.5 -3 cm) of the ‘V’ shaped cut and place in a clean container. Preparation of composite soil sample 1. Mix the collected soil samples thoroughly on a clean sheet. 2. Entire soil mass is spread 3. Divide into four quarters 29 4. Two opposite samples are discarded and remaining two are remixed. Repeat till 500 g sample is left 5. Storage & Labelling of soil samples 1. 2. 3. 4. 5. 30 Processing of soil samples for analysis • Drying - The soil samples are dried in shade. • Grinding - The sample is grinded using mortar to prepare it for sieving. • Sieving - Grinded soil sample is sieved through 2 mm stainless steel sieve and for specific",
  "quarters 29 4. Two opposite samples are discarded and remaining two are remixed. Repeat till 500 g sample is left 5. Storage & Labelling of soil samples 1. 2. 3. 4. 5. 30 Processing of soil samples for analysis • Drying - The soil samples are dried in shade. • Grinding - The sample is grinded using mortar to prepare it for sieving. • Sieving - Grinded soil sample is sieved through 2 mm stainless steel sieve and for specific analyis like Organic Carbon use 0.2 – 0.5 mm sieve. Remove plant residues, gravels, etc by retaining them on the sieve. Do's and Don'ts for soil sampling, processing & testing in Indian conditions: Do's: 1. Use a representative sampling method: Take multiple soil samples from different locations within the field to account for soil variability. Use a zigzag or W-pattern sampling approach to obtain a representative soil sample. 2. Sample at the right time: Soil sampling should ideally be done before the planting season or during the fallow period. 3. Take samples at the appropriate depth: The depth of soil sampling depends on the crop and its root zone. For most crops, a depth of 0 -15 cm is suitable. However, for deeper -rooted crops like sugarcane or tree plantations, sample up to 30 -60 cm depth or as recommended. Drying Grinding Sieving 31 4. Use clean sampling tools: Ensure that sampling tools such as a soil probe, auger, or shovel are clean and free from contaminants to prevent cross - contamination . 5. Label samples properly: Clearly label each soil sample with unique identifiers, including location, date , depth, and crop information. This helps in maintaining proper records and ensures correct interpretation of test results. 6. Store and handle samples correctly: Store soil samples in clean, labelled sample bags or containers to avoid mixing or contaminatio n. Keep samples in a cool, dry place until they are sent for testing. Don'ts: 1. Don't sample from atypical areas: Avoid sampling from areas with known soil variability, such as eroded spots, waterlogged areas, or areas near boundaries where different management practices may have been followed. 2. Don't sample immediately after fertili zer application: Wait for a sufficient period after fertilization to allow nutrients to mix uniformly in the soil. Sampling immediately after fertilization may result in inaccurate nutrient readings. 3. Don't use non -representative sampling tools: Avoid usin g galvanized or",
  "testing. Don'ts: 1. Don't sample from atypical areas: Avoid sampling from areas with known soil variability, such as eroded spots, waterlogged areas, or areas near boundaries where different management practices may have been followed. 2. Don't sample immediately after fertili zer application: Wait for a sufficient period after fertilization to allow nutrients to mix uniformly in the soil. Sampling immediately after fertilization may result in inaccurate nutrient readings. 3. Don't use non -representative sampling tools: Avoid usin g galvanized or rusty tools. These can affect the accuracy of the test results. 4. Don't sample from surface residues: Do not collect samples from areas with high surface residues. Remove surface residues from sample . 5. Don't rely solely on visual assessment: Visual soil assessments may provide some indications of soil health, but they cannot accurately determine nutrient deficiencies or imbalances. Soil testing is essential to obtain precise information for making nutrient management decisions. By adhering to these do's and don'ts, farmers, agronomists, and researchers can obt ain reliable soil test results. 32 Soil Testing & Analysis Soil testing is a set of various chemical processes that determine the amount of available plant nutrients in the soil. It is important because it determines the exact amount of available crop nutrients in the soil and provides a visible snapshot of soil properties (chemical/ physical/ biological). The results of soil testing will supply soil nutrients interpretation , which includes an indication of whether that particular soil is low, medium or high/ deficient or sufficient in that nutrient. Accordingly, fertilizer recommendations based on the analysis can be made. Digital Soil Testing Mini Lab / PUSA ST FR machine PUSA STFR METER KIT (PUSA Soil Test and Fertiliser Recommendation Meter Kit) is an advanced Soil Testing Kit authorised under the Government of India's Soil Health Card mission. This Digital Soil Testing Mini Lab is a low cost, user friendly digital embedd ed system instrument which can quantitatively estimate available nutrients in soil. It is a Soil Doctor that tests parameters of soil where the available nutrient in a soil is extracted with an extractant and a colour is developed in the extract with anoth er reagent. The colour intensity which is proportional to the amount of nutrient extracted is measured by this Soil Testing Meter. It recommends fertiliser dose from soil test values of for over 100 crops, prints Soil Health Card through in -built thermal",
  "quantitatively estimate available nutrients in soil. It is a Soil Doctor that tests parameters of soil where the available nutrient in a soil is extracted with an extractant and a colour is developed in the extract with anoth er reagent. The colour intensity which is proportional to the amount of nutrient extracted is measured by this Soil Testing Meter. It recommends fertiliser dose from soil test values of for over 100 crops, prints Soil Health Card through in -built thermal p rinter, sends Soil Testing Report to mobile via Bluetooth and computer via USB. 33 Significance of Digital Soil Testing Mini Lab / PUSA SFTR machine About 1244 soil testing laboratories (STLs) are available throughout the country, which are not sufficient to cater the soil testing needs of the farming community. There was long-felt need of a quantitative soil test kit to support the soil testing servic e. Digital Soil Testing Mini Labs would increase farmers‟ access to soil testing, and thus help them to achieve higher yields owing to soil test -based fertilizer application. Using the Soil Testing kit (Do's and don'ts for soil testing using a soil testing kit) When conducting soil testing in a laboratory using a soil testing kit, it's important to follow certain guidelines to ensure accurate and reliable results. Here are some do's and don'ts for soil testing in a laboratory using a soil testing kit: Do's: 1. Read and follow the instructions: Carefully read the instructions provided with the soil testing kit and follow them step by step. Each kit may have specific guidelines for sample preparation, reagent usage, and result interpretation. 2. Use cle an equipment: Ensure that all equipment used for testing, including containers, scoops, pipettes, and measuring devices, are clean and free from any residues that could contaminate the samples. 3. Mix and homogenize the soil sample: Thoroughly mix the soil sample to ensure a consistent representation of the field. Break up any clumps and remove stones or debris that could interfere with the testing process. 4. Measure accurately: Follow the provided guidelines for accurately measuring the soil and reagents. Use precise measuring devices, such as graduated cylinders or syringes, to ensure correct volumes are added. 34 5. Perform controls and calibration: Many soil testing kits include control samples or calibration standards. Use these samples to ve rify the accuracy of the kit and ensure that the test results fall",
  "Break up any clumps and remove stones or debris that could interfere with the testing process. 4. Measure accurately: Follow the provided guidelines for accurately measuring the soil and reagents. Use precise measuring devices, such as graduated cylinders or syringes, to ensure correct volumes are added. 34 5. Perform controls and calibration: Many soil testing kits include control samples or calibration standards. Use these samples to ve rify the accuracy of the kit and ensure that the test results fall within the expected range. Don'ts: 1. Don't contaminate the samples: Avoid cross -contamination between samples. Clean the equipment thoroughly between each sample to prevent carryover of reagents or residues that could impact the accuracy of subsequent tests. 2. Don't rush the process: Take your time to perform each step carefully and allow sufficient reaction times for accurate results. Rushing through the process can lead t o errors and inaccurate readings. 3. Don't extrapolate beyond the kit's capabilities: Soil testing kits have specific limitations and are designed to provide a basic assessment of certain soil parameters. Avoid extrapolating the results beyond the kit's i ntended use and consult a professional laboratory for comprehensive soil analysis if needed. 4. Don't neglect safety precautions: Some soil testing kits may involve the use of potentially hazardous reagents or chemicals. Follow safety precautions, such as wearing appropriate personal protective equipment (PPE), working in a well -ventilated area, and disposing of chemicals properly. 5. Don't rely solely on the kit for complex analysis: While soil testing kits can provide valuable insights into certain soil parameters, they may not be suitable for complex analysis or comprehensive nutrient management recommendations. Remember that soil testing kits provide a convenient and cost -effective option for basic soil analysis. However, it is advisable to consult a professional laboratory that specializes in soil testing. 35 Chapter 7: Data analysis and interpretation for Soil Samples Analysis Using Digital Soil Testing Mini Lab / PUSA SFTR machine Experiment I - Estimation of Soil pH Objective: To study the pH of soil sample Instrument required PUSA STFR meter Reagents Required : Standard pH 7.0: One 100 ml solution Standard pH 4.0 (In case of neutral to acid soil area) One 100 ml bottle. Standard pH 9.2 (In case of alkali soil area) One 100 ml bottle LR solution (In case of acid soil area) Two 100 ml bottle Procedure: Result: Record the result ---------------------------------------------------------------------------------------------------------------- Take",
  "PUSA SFTR machine Experiment I - Estimation of Soil pH Objective: To study the pH of soil sample Instrument required PUSA STFR meter Reagents Required : Standard pH 7.0: One 100 ml solution Standard pH 4.0 (In case of neutral to acid soil area) One 100 ml bottle. Standard pH 9.2 (In case of alkali soil area) One 100 ml bottle LR solution (In case of acid soil area) Two 100 ml bottle Procedure: Result: Record the result ---------------------------------------------------------------------------------------------------------------- Take 10 mL (12 g) for alluvial and red & 5ml soil for black soil with 24ml and 30 ml distilled water respectively. Stir the suspension for 2 minutes Calibration Put on the Soil Testing meter Press the enter button Record the pH reading. PH Calibration: Put the pH electrode in pH 7 buffer solution Enter and go to STD pH 7 and calibrate with pH 7 buffer solution and then go to STD pH 4 and calibrate with pH 4 buffer by dipping pH electrode i n pH 4 buffer solution. 36 Experiment II - Estimation of Electrical Conductivity of soil Objective: To study the EC of the given soil sample. Instrument required PUSA ST FR meter Reagents Required EC standard solution: One 100 ml bottle Procedure: Result: Record the result ---------------------------------------------------------------------------------------------------------------- Take 10 mL (12 g) for alluvial and red & 5ml soil for black soil with 24ml and 30 ml distilled water respectively. Stir the suspension for 2 minutes Calibration Enter to see the ‘Put the standard’ Dip the electrode in the standard solution and Enter Put on the Soil Testing Meter Press the enter button Record the EC reading Note down the reading 37 Experiment III - Estimation of Soil Organic Carbon Objective: To study the organic carbon of the given soil sample. Instrument required PUSA STFR meter Reagents Required : OC1: one 60 ml dropping bottle. ( 1ml for one test) OC2: one pack of 60 small vials (2 ml for one test ) Procedure: Result: Record the result (Annexure -II). Take six glass beakers and mark them as B (for blank) and 1,2,3,4,5 for samples Take 11 drops of distilled water in blank beaker marked as DW and 0.4 ml soil in beakers Add 1ml. OC1 in all the beakers and then add one vial OC2 in all the beakers Keep undisturbed for 30 minutes Then add 47 ml distilled water with the help of",
  "small vials (2 ml for one test ) Procedure: Result: Record the result (Annexure -II). Take six glass beakers and mark them as B (for blank) and 1,2,3,4,5 for samples Take 11 drops of distilled water in blank beaker marked as DW and 0.4 ml soil in beakers Add 1ml. OC1 in all the beakers and then add one vial OC2 in all the beakers Keep undisturbed for 30 minutes Then add 47 ml distilled water with the help of 50 ml measuring cylinder to all the beakers and mix them with a glass rod Take another set of five glass beaker and mark them as 1,2,3,4 and 5 Filter the sample solutions. Take readings of the blank solution first and then one by one the sample solutions. OC1 reagent crystallizes in cold. Before using it should be warmed and shake to dissolve the crystals Caution OC2 is very corrosive and should not come in contact with skin 38 Experiment IV - Estimation of Soil Available Nitrogen Objective: To study the available nitrogen content of given soil sample. Instrument required PUSA STFR meter Reagents Required : Procedure: Result: Record the result ---------------------------------------------------------------------------------------------------------------- Calculated from organic carbon content of soil 39 Experiment V - Estimation of Soil Phosphorus Objective: To study the phosphorus content of given soil sample. Instrument required : PUSA STFR meter Reagents Required : PHX: 10 vials, of 5 ml capacity, the content of each of which has to be dissolved in 100 ml distilled water in a 100 ml bottle for 5 tests. PH1: One 100 ml bottle PH2: Two 100 ml bottles PH3: 10 vi als of 5 ml capacity, the content of each has to be dissolved in 50 ml distilled water in a 100 ml dropping bottle for 5 tests. P free charcoal: one 100 ml container having 100 ml P free charcoal Procedure: See Next Page 40 Result: Record the result ---------------------------------------------------------------------------------------------------------------- 0.5 ml (0.6 g) soil + 12 ml of PHX+ 0.3 (0.6 ml in case of red and black soil) ml of charcoal Shake for half an hour and filter. 12 ml of PHX+0.3 (0.6 ml in case of red and black soil) charcoals. Shake for half an hour and filter. 2 ml sample extract +5 drops PH1 + 2ml PH2 + 1 ml PH3 Dilute to 10 ml Keep for 15 min. 2 ml blank extract +5 drops PH1 +",
  "ml (0.6 g) soil + 12 ml of PHX+ 0.3 (0.6 ml in case of red and black soil) ml of charcoal Shake for half an hour and filter. 12 ml of PHX+0.3 (0.6 ml in case of red and black soil) charcoals. Shake for half an hour and filter. 2 ml sample extract +5 drops PH1 + 2ml PH2 + 1 ml PH3 Dilute to 10 ml Keep for 15 min. 2 ml blank extract +5 drops PH1 + 2ml PH2 + 1 ml PH3 Dilute to 10 ml Sample: Blank Reagent Preparation PHX: Dissolve the content of 5 ml vial PHX In 100 ml DW in dropping bottle PHS: Dissolve the content of 2 ml vial PH3 in 50 ml DW dropping bottle Colour Development Sample Colour Development Blank Keep for 15 min. 41 Experiment VI - Estimation of Soil Potassium Objective: To study the potassium content of given soil sample. Instrument required : PUSA STFR m eter Reagents Required : PSX: 10 vials of PSX1 and 10 vials of PSX2. The contents of one vial of each of PSX1 and PSX2 have to be dissolved in 125 ml of distilled water in 125 ml dropping bottles to get PSX. PT1: One 100 ml bottle PT2: One 100 ml bottle PS2: One 100 ml bottle PT3: 10 vials, the content of each is to be dissolved in 10 ml in dropping bottle for 5 tests Procedure: 2.5 ml (3 g) soil + 15 ml PS X. Pinch of charcoal (0.3 ml) Shake for half an hour and filter 20 ml PS X. + pinch of charcoal (0.3 ml) Shake for half an hour and filter. Sample: Blank: Reagent Preparation PSX: Dissolve the content of PSX1 and PSX2 In 125 ml distilled water in dropping bottle. PT3: Dissolve the content of 2 ml vial PT3 in 10 ml DW in dropping bottle& Finer. 42 1 ml sample extract + 1ml blank extract + 1 ml PT1+ 11 drops PT2 Shake up and down three times with cap closed. Wait for three minutes. Add 5 drops of PT3 quickly and wait for 1 minute. Colour Development Sample Shake up and down three times with cap closed. Add 1 ml PS2 and dilute to 10 ml with water and shake up and down three times with cap closed. Keep for 5 min. 43 Result: Record the result ---------------------------------------------------------------------------------------------------------------- 2 ml blank",
  "1ml blank extract + 1 ml PT1+ 11 drops PT2 Shake up and down three times with cap closed. Wait for three minutes. Add 5 drops of PT3 quickly and wait for 1 minute. Colour Development Sample Shake up and down three times with cap closed. Add 1 ml PS2 and dilute to 10 ml with water and shake up and down three times with cap closed. Keep for 5 min. 43 Result: Record the result ---------------------------------------------------------------------------------------------------------------- 2 ml blank extract + 1 ml PT1 + 11 drops PT2. Shake up and down three times with cap closed. Wait for three minutes. Add 5 drops of PT3 quickly and wait for 1 minute. Shake up and down three times with cap closed. Colour Development Blank Add 1 ml PS2 and dilute to 10 ml with water and shake up and down three times with cap closed. Keep for 5 min. Calibration with Potassium Standard: 1 ml standard solution + 1ml blank extract + 1 ml PT1+ 11 drops PT2. Shake up and down three times 17 with cap closed Wait for three minutes. Add 5 drops of PT3 quickly and wait for 1 minute. Shake up and down three times with cap closed Add 1 ml PS2 and dilute to 10 ml with water and shake up and down three times with cap closed. Keep for 5 min Enter reading in the STANDARD option of th e meter. 44 Experiment VII - Estimation of Sulphur content in soil Objective: To study the sulphur content of given soil sample. Instrument required PUSA ST FR meter Reagents Required : SW: One 100 ml bottle of solution S1 : One 100 ml bottle of solution S2: One 100 ml container containing solid powder material S3: One empty 100 ml dropping bottle (solution to be prepared during testing) S4: One 100 ml dropping bottle of standard solution (All reagents except PS2 have lifetime of six months; the life of PS2 is three months. Solid reagents supplied, once dissolve d in water can be used for one day only.) Procedure: See next page Extraction: Same as potassium 45 Result: Record the result (Annexure -II). ---------------------------------------------------------------------------------------------------------------- 5 ml sample extract +4 drops S3+0.3 ml solid S2. Shake up and down 50 times till solid dissolves and keep it for 5 minutes. Then add 1 ml S1 Shake up and down 10 times and keep it for",
  "six months; the life of PS2 is three months. Solid reagents supplied, once dissolve d in water can be used for one day only.) Procedure: See next page Extraction: Same as potassium 45 Result: Record the result (Annexure -II). ---------------------------------------------------------------------------------------------------------------- 5 ml sample extract +4 drops S3+0.3 ml solid S2. Shake up and down 50 times till solid dissolves and keep it for 5 minutes. Then add 1 ml S1 Shake up and down 10 times and keep it for 25 minutes and take reading Colour Development Sample 5 ml black extract + 4 drops S3+ 0.3 ml solid S2+ Shake up and down 50 times till solid dissolves and keep it for 5 minutes. Add 1 ml S1. Shake up and down 10 times and keep it for 25 minutes and take reading Calibration with Sulphur standard: 5 ml standard solution +4 drops S3+ 0.3 ml solid S2. Shake up and down 50 times till solid dissolves and keep it for 5 minutes. Then add 1 ml S1. Shake up and down 10 times and keep it for 25 minutes and take reading. Colour Development Blank 46 Experiment VIII - Estimation of Zinc content in soil Objective: To study the zinc content of given soil sample. Instrument required : PUSA STFR meter Reagents Required : ZNX: 10 vials, of 5 ml capacity, the content of each of which has to be dissolved in 100 ml distilled water in a 100 ml bottle for 5 samples and one blank. ZN1: (ZN1A for alluvial and red soil, ZN1B for high clay or black soil) Two 100 ml bottle (200 ml solution) ZN2: Two 100 ml bottle (150 ml solution) ZN3: 10 vials (1ml capacity), the content of each is to be dissolved in 100 ml solution in dropping bottle for 5 tests ZN41: 10 vials (dark colour 1 ml capacity) t he content of each is to be dissolved in 25 ml ZN42 solution and filtered in dropping bottle for 5 tests Procedure: Result: Record the result ---------------------------------------------------------------------------------------------------------------- Reagent ZNX: Dissolve the content of ZNX in 100 ml distilled water. ZN3: Dissolve the contents of vial in 50 ml DW ZN4: Take the content of 2ml dark vial ZN41 in 50 ml dropping bottle and add 25 ml ZN42 solution shake well to dissolve it 2.5 ml (3 g) soil + 15 ml ZNX. Shake for half an hour and filter",
  "ml ZN42 solution and filtered in dropping bottle for 5 tests Procedure: Result: Record the result ---------------------------------------------------------------------------------------------------------------- Reagent ZNX: Dissolve the content of ZNX in 100 ml distilled water. ZN3: Dissolve the contents of vial in 50 ml DW ZN4: Take the content of 2ml dark vial ZN41 in 50 ml dropping bottle and add 25 ml ZN42 solution shake well to dissolve it 2.5 ml (3 g) soil + 15 ml ZNX. Shake for half an hour and filter 2 ml sample extract+3ml ZN1(A for alluvial and B for black soil) + 2 ml ZN2+ 1ml ZN3+ 2ml ZN4. Keep for 15 min 2 ml blank (ZNX)+, 3ml ZN1(A for alluvial and B for black soil) + 2 ml ZN2+ 1ml ZN3+ 2ml ZN4. Keep for 15 min. Sample Extraction: Colour Development Sample Colour Development Blank 47 Experiment IX - Estimation of Iron content in soil Objective: To study the iron content of given soil sample. Instrument required PUSA STFR meter Reagents Required : ZNX as in case of zinc FE1: One 100/125 bottle containing 100 ml solution FE2: One 100/125 bottle containing 100 ml solution Procedure: Extraction: Same as Zinc Result: Record the result ---------------------------------------------------------------------------------------------------------------- 2 ml sample extract + 1ml ZNX+1 ml FE1+ 1ml FE2. Keep for 15 min 2 ml blank (ZNX) + 1ml ZNX+1 ml FE1+ 1ml FE2. Keep for 15 min Colour Development Sample Colour Development Blank 48 Experiment X - Estimation of Copper content in soil Objective: To study the copper content of given soil sample. Instrument required PUSA STFR meter Reagents Required : ZNX as in case of zinc CU1: One 100/125 bottle containing 100 ml solution CU2: CU1: One 100/125 bottle containing 100 ml solution CU3: 10 vials ( 1ml capacity), the content of each is to be dissolved in 50 ml DW in dropping bottle for 5 tests Procedure: Extraction: Same as Zin c Result: Record the result ---------------------------------------------------------------------------------------------------------------- Reagent Preparation ZNX: Same as above CU3: Dissolve the 2ml vial CU3 contents in 50 ml DW 4 ml sample extract+ 2 ml CU1 +1 ml CU2 Filter + 1ml CU3 Keep for 15 min 4 ml blank (ZNX) + 2ml CU1+1 ml CU2 Filter + 1ml CU2+1ml CU3 Keep for 15 min Colour Development Sample Colour Development Blank 49 Experiment XI - Estimation of Manganese content in soil Objective: To study the manganese content of given soil sample. Instrument required",
  "Preparation ZNX: Same as above CU3: Dissolve the 2ml vial CU3 contents in 50 ml DW 4 ml sample extract+ 2 ml CU1 +1 ml CU2 Filter + 1ml CU3 Keep for 15 min 4 ml blank (ZNX) + 2ml CU1+1 ml CU2 Filter + 1ml CU2+1ml CU3 Keep for 15 min Colour Development Sample Colour Development Blank 49 Experiment XI - Estimation of Manganese content in soil Objective: To study the manganese content of given soil sample. Instrument required PUSA STFR meter Reagents Required : MNX: 10 vials, of 5 ml capacity, the content of each of which has to be dissolved in 100 ml distilled water in a 100/125 ml bottle for 5 samples and one blank. MN1: One 100/125 bottle containing 100 ml solution MN2: One 100 ml container containing 20 g o f solid powder Procedure: Result: Record the result Reagen t MNX: Dissolve the content of MNX in 100 ml distilled water Sample: 2.5 ml (3 g) soil + 15 ml MNX. Shake for half an hour and filter 5 ml sample extract+0.5 ml MN1+0.2 g MN2. Shake and keep in boiling water for 5 minutes and take reading after 15 min 5 ml blank (MNX) +0.5 ml MN1+0.2 g MN2. Shake and keep in boiling water for 5 minutes and take reading after 15 min Sample Extraction: Colour Development Sample Colour Development Blank 50 Experiment XII - Estimation of Boron content in soil Objective: To study the boron content of given soil sample. Instrument required : PUSA STFR meter Reagents Required : BX: 10 vials of BXA and 10 vials of BXB. To make BX the contents of one BXA and one BXB vial have to be dissolved in 250 ml distilled water. First dissolve BXA in BXB + some water and then make volume up to 250 ml B1: One 100 ml dropping bottle B2: 10 via ls, the contents of which have to be dissolved in 10 ml of distilled water in a 50 ml dropping bottle. Procedure: Result: Record the result. ---------------------------------------------------------------------------------------------------------------- Reagent BX: Dissolve both the contents of one BXA and one BXB in 250 ml distilled water in the bottle marked as BX B2: Dissolve the contents of each vial in 10 ml distilled water for one day use 10 ml soil (12.0g) +24 ml of BX. Shake for half an hour and filter with double filter paper. 3ml",
  "to be dissolved in 10 ml of distilled water in a 50 ml dropping bottle. Procedure: Result: Record the result. ---------------------------------------------------------------------------------------------------------------- Reagent BX: Dissolve both the contents of one BXA and one BXB in 250 ml distilled water in the bottle marked as BX B2: Dissolve the contents of each vial in 10 ml distilled water for one day use 10 ml soil (12.0g) +24 ml of BX. Shake for half an hour and filter with double filter paper. 3ml sample extract+1ml B1+1ml B2 Keep it for half an hour and take reading. 3 ml blank (BX) + 1 ml B1+1 ml B2. Keep it for half an hour and take reading. Extraction: Colour Development Sample Colour Development Blank 51 Chapter 8: Assessment and Evaluation Interpretation of Results Interpretation refers to the task of drawing inferences based on the results of soil samples analysis. The interpretation of soil test results will typically indicate whether a nutrient level is – Low or (in case of macro - nutrients) Deficient or (in case of micro - nutrients) Medium (moderate) or (in case of macro - nutrients) Sufficient (in case of micro - nutrients) High (adequate)/ Very high (in case of macro - nutrients) High Acidity/ Alkalinity (in case of soil pH) These levels are known as “nutrient classes” or categories. The nutrient classes or categories used in Digital Soil Testing Mini Lab for 12 soil health parameters are as given below - Soil pH pH range Classes <4 Extremely acid 4-5 Strongly acid 5-6 Moderately acid 6-7 Slightly acid 7 Neutral 7-8 Moderately alkaline >8.5 Strongly alkaline 52 Soils are not happy in High Acidity/ Alkalinity conditions. Because it indicates the major nutrient deficiencies in soils (in high acidic soils) and trace element deficiencies along affecting other soil prop erties in soils (in high alkaline soils). Soil EC EC range of extract (dS/m) Salt (%) range in soil Classes 0-0.4 0-0.05 Non saline (Salinity effect mostly negligible) 0.4-0.8 0.05-0.1 Very slightly saline (Yield of very sensitive crops may be restricted) 0.8-1.6 0.1-0.2 Moderately saline (Yield of many crops restricted) >1.6 >0.2 Strongly saline (Only tolerant crops yield satisfactorily) NOTE - Alluvial soil (silt loam) = soil: water is 1:2; Black soil (clay loam)= soil: water is 1:5 Soils are not happy in Salinity conditions. Because it affects the growth of plants. Soil Organic Carbon (OC) OC range (%) Classes <0.5 Low 0.5",
  "saline (Salinity effect mostly negligible) 0.4-0.8 0.05-0.1 Very slightly saline (Yield of very sensitive crops may be restricted) 0.8-1.6 0.1-0.2 Moderately saline (Yield of many crops restricted) >1.6 >0.2 Strongly saline (Only tolerant crops yield satisfactorily) NOTE - Alluvial soil (silt loam) = soil: water is 1:2; Black soil (clay loam)= soil: water is 1:5 Soils are not happy in Salinity conditions. Because it affects the growth of plants. Soil Organic Carbon (OC) OC range (%) Classes <0.5 Low 0.5 – 0.75 Medium >0.75 High Saline soils Non saline soils 53 Soils are happy in when soil organic carbon is high. Because then soils are healthy. Nitrogen Nitrogen (kg/ ha) Classes <280 Low 280 - 560 Medium > 560 High Phosphorus Phosphorus (kg/ ha) Classes <10 Low 10 – 25 Medium > 25 – 50 High > 50 Very High Potassium Potassium (kg/ ha) Classes <120 Low 120 – 280 Medium > 280 – 600 High > 600 Very High Soils are happy in when Nitrogen, Phosphorus and Potassium (Macro - nutrients) are high in soils. Because these are essential nutrients for plant growth. 54 Sulphur Sulphur (ppm) Classes <10 Deficient >10 Sufficient Micro -nutrients, i.e., Zinc, Iron, Copper, Manganese, Boron Soils are very happy when Macro as well as Micro nutrients are high/ sufficient in soils. Because plants need these are essential nutrients from soils for its growth. Conversion Factor to Multiply Soil Testing Value to Get STL Value Nutrient Extractant Critical limit for STL (mg/kg) Critical limit for Soil Testing Meter (mg/kg) Factor to multiply Soil Testing Meter to get STL S 0.15% CaCl 2 10 10 1 Zn 0.005M DTPA+0.01M CaCl 2+0.1M TEA 0.6 1.3 0.461 Fe -do- 4.5 14.0 0.321 Cu -do- 0.2 0.72 0.277 Mn -do- 2.5 2.5 1 B Hot water 0.5 0.5 1 Zinc (ppm) Iron (ppm) Copper (ppm) Manganese (ppm) Boron (ppm) Classes <0.6 <4.5 <0.2 <2.0 <0.5 Deficient >0.6 >4.5 >0.2 >2.0 >0.5 Sufficient 55 Recommended Dose of Fertilizers (RDF) Soil Test Value RDF If Soil Test Value of any of the nutrient lies in the LOW category Apply 25 % more than RDF If Soil Test Value of any of the nutrient lies in the MEDIUM Apply RDF If Soil Test Value of any of the nutrient lies in the HIGH category Apply 25 % less than RDF If Soil Test Value of any of the nutrient lies in the",
  ">2.0 >0.5 Sufficient 55 Recommended Dose of Fertilizers (RDF) Soil Test Value RDF If Soil Test Value of any of the nutrient lies in the LOW category Apply 25 % more than RDF If Soil Test Value of any of the nutrient lies in the MEDIUM Apply RDF If Soil Test Value of any of the nutrient lies in the HIGH category Apply 25 % less than RDF If Soil Test Value of any of the nutrient lies in the VERY HIGH category Do not apply any f ertilizer of that nutrient. 56 Chapter 9: SOP s for use of a mobile app for soil sample collection, laboratory analysis, and soil health card generation in Indian soil 1. Choose SHC soil sample collection mobile app on google play store: Select a SHC mobile app of Department of Agriculture and F armer welfare specifically designed for soil sample collection and analysis. 2. Download and Install the SHC mobile app : Download the app from google play store, and install it on your mobile device. Ensure that your device meets the app's compatibility requirements. 3. Register and Create an Account: Open the app and register by providing the required information. Create an account using schools’ name as username and password to access the app's features. 4. Field Soil S ample Collection: After creating the account, user will login using their credentials once they enter into the field or plot for which he/ she want to collect soil samples. 5. Farmer’s registration: Students will introduce the mobile app to the farmers and request to download & register under soil sample co llection services in the app themselves with their mobile/ Adhaar / name. 6. Sample Collection : Enter the relevant details for each soil sample, such as sample ID, location, crop, and any other required information. The app may provide a map or GPS feature to identify and mark the field location accurately. Follow the app's instructions to collect s oil samples using proper sampling techniques, including depth and sample numbers. 7. Submit Samples and Request Analysis: Use the app to submit the collected soil samples to a designated laboratory for analysis. The app may provide options to select a prefer red laboratory or recommend nearby labs for convenience. 57 8. Laboratory Analysis and Results: The laboratory will perform the necessary tests on the soil samples and generate the test results. The app",
  "Follow the app's instructions to collect s oil samples using proper sampling techniques, including depth and sample numbers. 7. Submit Samples and Request Analysis: Use the app to submit the collected soil samples to a designated laboratory for analysis. The app may provide options to select a prefer red laboratory or recommend nearby labs for convenience. 57 8. Laboratory Analysis and Results: The laboratory will perform the necessary tests on the soil samples and generate the test results. The app will notify you when the results are ready. The app may als o allow you to track the progress of your samples in real -time. 9. View and Interpret Results: Access the test results through the app. The results may include information on nutrient levels, pH, organic matter, and other relevant soil parameters. The app ma y provide interpretation guidelines or generate a soil health card based on the results. 10. Generate Soil Health Card: The app suppor ts soil health card generation where one can get the test results as digital or printable form. The card will include recomm endations for fertilizer application, soil amendments, and other management practices based on the specific soil conditions. 11. Review Recommendations and Take Action: Review the recommendations provided by the app based on the soil test results and soil hea lth card. Use the information to make informed decisions regarding nutrient management, soil amendments, and crop -specific practices to optimize productivity and sustainability."
]