[
  "A status note on Rice in India Background In India rice is grown in 43.86 million ha, the production level is 104.80 million tones and t he productivity is about 2390 kg/ha (Agricultural Statistics at a glance - 2015 ). It is grown under diverse soil and climatic conditions the productivity level of rice is low compared to the productivity levels of many countries in the world. Also about 90 % of the cultivated land belongs to Marginal, Small and Medium farmers which is ano ther constrain in increasing the productivity of rice in the country . It is, therefore , there is ample scope to increase the productivity of rice in the country. The highest productivity is 6710 kg per ha of China followed by Vietnam (5573 kg /ha), Indones ia (5152 kg/ha), Bangladesh (4375 kg/ha) etc There are improved technologies and various interventions which could be adapted to increase the productivity in the country . Cultivation of hybrid rice has potential to increase the productivity and needs to be promoted . Rice Growing Regions : The rice growing areas in the country can be broadly grouped into five regions as given below: i. North -Eastern Region: This region comprises of Assam and North eastern states. In Assam rice is grown in the B asin of Brahmnaputra River. This region receives very heavy rainfall and rice is grown u nder rain fed condition. ii. Eastern Region: It region comprises of Bihar, Chhattisgarh, Jharkhand, Madhya Pradesh, Orissa, Eastern Uttar Pradesh and West Bengal. In this region rice is grown in the basins of Ganga and Mahanadi rivers and has the highest intensity of rice cultivation in the country. Th is region receives heavy rainfall and rice is grown mainly under rain fed conditions. iii. Northern Region: This region comprises of Haryana, Punjab, Western Uttar Pradesh, Utt arakhand, Himachal Pradesh and Jammu & Kashmir. The region experiences low winter temp erature and single crop of rice from May -July to September - December is grown. iv. Western Region: This region comprises of Gujarat, Maharashtra and Rajasthan. Rice is largely grown under rainfed condition during June -August to October - December. v. Southern Regi on: This region comprises of Andhra Pradesh, Karnataka, Kerala and Tamil Nadu. Rice is mainly grown in deltaic tracts of Godavari, Krishna and Cauvery rivers and the non -deltaic rainfed area of Tamil Nadu and Andhra Pradesh. Rice",
  "and single crop of rice from May -July to September - December is grown. iv. Western Region: This region comprises of Gujarat, Maharashtra and Rajasthan. Rice is largely grown under rainfed condition during June -August to October - December. v. Southern Regi on: This region comprises of Andhra Pradesh, Karnataka, Kerala and Tamil Nadu. Rice is mainly grown in deltaic tracts of Godavari, Krishna and Cauvery rivers and the non -deltaic rainfed area of Tamil Nadu and Andhra Pradesh. Rice is grown under irrigated c ondition in deltaic tracts. Main Rice growing countries in the world : The area, production and productivity of fir st five highest producing countries of rice in the world are given below: Area: million ha, Production: million tones and yield in kg/ha Country Area Production Productivity Production % 1. China 30.58 205.21 6710 27.70 2. India 43.86 104.80 2390 21.81 3. Indonesia 13.84 71.29 5152 9.62 4. Bangladesh 11.78 51.50 4376 6.95 5.Vietnam 7.90 44.04 5573 5.94 Total for World 107.96 476.84 4417 Source :Agricultural statistics at a glance 2015 The d etails of APY for the major rice growing countries given in Annexure - I. Status of Rice in the country Rice is one of the most important food crops and feeds more than 60 per cent population of India . The area under rice crop was 30.81 million/ha in 1950 -51 which has increased to 43.86 million hectare s during 2014 -15 which is nearly 142 per cent higher. The rice production has registered an ap preciable increase from 20.58 million tonnes in 1950 -51 to 104.86 million tonnes during 2014 -15, which is nearly 5 times. The yield was 668 kg/ha in 1950 -51 which has increased to 2390 kg/ha during 2014 -15. Major share of rice production is in Kharif season. State wise Area, Production and Yield : Rice is grown in almost all the states in the country however the major 5 states in rice production are West Bengal, UP, Andhra Pradesh, Punjab and Tamil Nadu . The west Bengal produces 15 percent of tota l quantity of r ice produced in the country . State wise Area, Production and Yield (APY) of rice during the period 2010 -11 to 2014 -15 are given at Annexure I I. Agronomic Practices : Land preparation The field is prepared by ploughing the rice fields with soil turning plough followed by harrowing. T",
  "major 5 states in rice production are West Bengal, UP, Andhra Pradesh, Punjab and Tamil Nadu . The west Bengal produces 15 percent of tota l quantity of r ice produced in the country . State wise Area, Production and Yield (APY) of rice during the period 2010 -11 to 2014 -15 are given at Annexure I I. Agronomic Practices : Land preparation The field is prepared by ploughing the rice fields with soil turning plough followed by harrowing. T he rice field is filled with water and is puddle d twice by paddy puddler or once by rotavator. If green manure crop like dhaincha or mung has been taken , it may be mixed with rotavator during puddling followed by planking. Seed r ate: The seed rate of rice varies based on the methods of sowing/transplanting. In broadcasting method seed rate is about 8 0kg/ha under transplanting method it is about 20- 30 kg/ha and under SRI method seed rate is only 5 -8 kg/ ha. . Seed treatment Seed treatment is done by dissolving 10 g carbendaz im (Bavistin) and 1g streptocycline in 10 litres of water sufficient for 10 kg seed . The soaked seed should be for 24 hours before sowing or transplanting . The soaked seeds are covered till it is sprouted . Sowing method: Following two methods are commonly practiced: (a) Direct seeding or Broadcasting method : In this method seed is directly sown in unpuddled and puddle fie ld prepared for sowing at appropriate moisture level. (b) Transplanting method: In this method a nursery is prepared for transplanting of rice as required for the methods of transplanting. For manual transplanting the nursery is prepared in 1/20th of transplanting usually on raised beds. For mechanical transplanting the nursery is raised as mat or tray nursery. The 25 days old seedlings ( 4 -5 leaf stage) uprooted from the nursery –bed are the transplanted 3 -4 cm deep following 20cm x 10cm spacing with 2 -3 seedlings/ hill in the line planting and 10cm x15 cm in random planting. However, in case of SRI 10 days old nursery is transplanted at 25 cms X 25 cms spacing of only 1 -2 plants per hill. Sowing Time : The rice is grown almost in all crop seasons ie Kharif, Rabi and summar in the country. However, depending upon the prevailing weather, it is sown in different",
  "-4 cm deep following 20cm x 10cm spacing with 2 -3 seedlings/ hill in the line planting and 10cm x15 cm in random planting. However, in case of SRI 10 days old nursery is transplanted at 25 cms X 25 cms spacing of only 1 -2 plants per hill. Sowing Time : The rice is grown almost in all crop seasons ie Kharif, Rabi and summar in the country. However, depending upon the prevailing weather, it is sown in different periods in different regions. Manures and Fertilizer Management The fertilizers and organic manures may be app lied based on available soil nutrients after the soil tests. The objective should be to reduce the input costs to obtain optimum productivity. In general, about 80 -100 kg nitrogen /ha is applied in 3 split doses ; half (40 - 50 kg ) as basal dose, one forth ( 20-25 kg) at tillering stage and remaining a week before panicle initiation where top dressing is not possible. Along with basal dose (50% of nitrogen) 40-45 kg P 2 O5 and 30 -40 kg K 2O are also applied depending on soil test. Bio fertilizers such as blue green algae or Azolla provide 20 -25 kg N/ha, which may be added as partial supplement to inorganic fertilizer. The application of micro -nutrients may also be applied based on soil test. Water management Uniform leveling of fi eld and proper drainage are most essential for an effective water management in irrigated field. Efficient water - management facilitates good tillering and better nitrogen uptake and help s in reduc ing weed population. PLANT PROTECTION Weed management: The problem of weeds is less in puddled fields but it is high in un puddled fields. Usually, 2-3 hoeing or manual picking of weeds are required to control the weed s. Some herbicides such as Anilophos, Butachlor, Anilophos +Ethoxysulfuron, Pyrosolfuron -ethyl, Almix +Butachlor , Fentrazamide , Cinmethyline +2,4D are used. Disease: Diseases Control Khiara 5kg zinc with 2.5 kg lime(in 1000 liters of water ) / ha 10 days after transplanting Blast Seed treatment with thiram @ 2.5g/kg of seed or tricyclazole 75 wp @ 1.5 g/ kg of seed Brown spot Carbendazim 50wp @ 2.0 g/kg seed or Mancozeb 75wp @ 2.5g/kg Bacterial leaf blight Seed treatment with streptocycline (1g) + carbendazim 50 W.P. (20g) for 8 –10 kg of seed in 10 litres of water for 12",
  "used. Disease: Diseases Control Khiara 5kg zinc with 2.5 kg lime(in 1000 liters of water ) / ha 10 days after transplanting Blast Seed treatment with thiram @ 2.5g/kg of seed or tricyclazole 75 wp @ 1.5 g/ kg of seed Brown spot Carbendazim 50wp @ 2.0 g/kg seed or Mancozeb 75wp @ 2.5g/kg Bacterial leaf blight Seed treatment with streptocycline (1g) + carbendazim 50 W.P. (20g) for 8 –10 kg of seed in 10 litres of water for 12 – 15 hours Insect: Insect Control Gundhi bug Spray carbaryl 50 wp @1,500 g/ha during afternoon hours Stem Borer Spray Cartap 50 wp @800 g/ha chlorpyriphos 20EC 2,000 ml/ha Brown p lant hopper Spray Imidacloprid 200 Sl@125 ml/ha Harvesting and threshing : The crop should be harvested when the grains turn yellow moisture content is below 25 %. The harvesting and threshing is done manually and also by combine harvesters and threshers. Export and Import of rice The details of export and import of Basmati Rice and non Basmati rice for the period 2010 - 11 to 2016 -17, are given in the Annexure III – IV. Basmati Rice: The export of basmati rice during 2010 -11 was 23.71 lakh tonnes while in the year of 2015 -16 it was 40.45 lakh tonnes which is highest during this period. Import of Basmati rice is negligible in the country. I mport of basmati rice was 0.0046 lakh tonnes only in the year 2010 -11. Non-Basmati Rice : India is exporting substantial quantity of non -basmati rice to various countries in the world. However, the export of non -basmati rice has been fluctuating year to year due to Govt. policy. The export of non -basmati rice during 2010 -11 was 1.01 lakh tonnes, the export ro se to 82.25 lakh tones during 2014 -15. Minimum Support Price of Rice The Minimum Support Prices (MSPs) for paddy is fixed by the Department of Agriculture & Cooperation on the recommendations of the CACP since 2012 -13 to 2016 -17 (marketing seasons) are as under: - (Rs. Per qtl ) Marketing season MSP of Paddy Common Grade A 2012 -13 1250 1280 2013 -14 1310 1345 2014 -15 1360 1400 2015 -16 1410 1450 2016 -17 1470 1510 Procurement by Public Agencies The rice is procured by public agencies in the country. The major states contributing to the procurement are Punjab, Chhattisgarh, Telangana, Andhra Pradesh",
  "Agriculture & Cooperation on the recommendations of the CACP since 2012 -13 to 2016 -17 (marketing seasons) are as under: - (Rs. Per qtl ) Marketing season MSP of Paddy Common Grade A 2012 -13 1250 1280 2013 -14 1310 1345 2014 -15 1360 1400 2015 -16 1410 1450 2016 -17 1470 1510 Procurement by Public Agencies The rice is procured by public agencies in the country. The major states contributing to the procurement are Punjab, Chhattisgarh, Telangana, Andhra Pradesh etc The details of procurement year wise for the period 2012 -13 to 2015 -16 are given at Annexure VI. Main Programmes/ Schemes of Rice Crops Division of Department of Agriculture, Cooperation and Farmers Welfare (DAC & FW) is implementing various crop development schemes for increasing production and productivity of the crop s in the country viz. National Food Security Mission ( NFSM ) on rice, wheat, pulses ,coarse cereals and commercial crops cotton, jute & sugarcane) and Bringing Green Revolution to eastern India (BGREI ) to increase the production and productivity of ric e. NFSM NFSM -Rice is being implemented in 25 states covering 199 potential districts. Those districts have been selected which have more than 50, 000 ha area under rice and productivity is less than state average. Under NFSM, crop of production technologies are being promoted at the farmers field through organization of clusters demonstration and cropping system demonstrations, distribution of seeds which are less than 10 years old, application and INM and IPM, distribution of efficient farm machines to farmers to reduce the cost of cultivation, application of efficient use of water by using micro irrigation systems and pipes for water conveyance, training of farmers with latest crop production technologies such as timely sowing , seed rate recommended package of practices etc . For reduction in the co st of cultivation, at least 30% of the cluster demonstration under NFSM is being conducted by adopting cropping system approach to utilize the rice fallow area s for pluses and oil seeds cultivation. Assistance is given to farmers on distribution of improved seeds /hybrids , farm implements machine, irrigation devices plant protection chemicals bio pesti cides for promoting integrated pest m anagement and soil ameliorants etc. Thr ough State Government s new initiatives have been introduced such as free distribution of seed mini -kits of newer varieties of pulses , production of quality seeds (breeder , foundation and",
  "system approach to utilize the rice fallow area s for pluses and oil seeds cultivation. Assistance is given to farmers on distribution of improved seeds /hybrids , farm implements machine, irrigation devices plant protection chemicals bio pesti cides for promoting integrated pest m anagement and soil ameliorants etc. Thr ough State Government s new initiatives have been introduced such as free distribution of seed mini -kits of newer varieties of pulses , production of quality seeds (breeder , foundation and certified seeds ) , creation of seed hubs at SAU and KVKs , strength ening of bio fertilizers and bio agent labs at SAUs / ICAR Institute , technological demonstration by KVKs and enhancing pulses production and productivity . The commercial c rops (cotton /jute/ sugarcane) primarily focus on cropping system approach for tra nsfer of technology in the approved states. Also, u nder NFSM , there is provision of cropping system based training of f armers which includes four sessions i.e. one before kharif and rabi season one each during kharif and rabi season. Under this programme t raining of trainers /farmers is imparted by crop subject matter specialist of ICAR Institute /SAUs/KVKs and involves various crop management practices (agronomic and plant protection practices ) including primary processing of produces , storage etc. and also to create awareness about the new high yielding varieties /hybrids and new practices . A group of 30 participants /farmers in each session and participants in all four session remain same Central assistant of Rs. 14000/ per training (Rs 3500 / -per se ssion) in made available. The details of funds released to states and expenditure incurred for the period of 12th Plan are given in the Annexure V. BGREI The programme of Bringing Green Revolution to Eastern India (BGREI) was initiated in 2010 - 11 as a sub scheme of RKVY which intended to address the constraints limiting the productivity of “rice based cropping systems” in Eastern India comprising seven (7) States namely, Assam, Bihar, Chhattisgarh, Jharkhand, Odisha, Eastern Uttar Pradesh and West Bengal . The objective is to increase the crop productivity by intensive cultivation through promotion of recommended agriculture techn ologies and package of practice. The demonstrations, introduction of new seed varieties, farm machines & implements, nutri ents, pesticides and knowledge based intervention s developed for different agro -climatic zones are promoted. During 2013 -14, based on the experience of implementation",
  "cropping systems” in Eastern India comprising seven (7) States namely, Assam, Bihar, Chhattisgarh, Jharkhand, Odisha, Eastern Uttar Pradesh and West Bengal . The objective is to increase the crop productivity by intensive cultivation through promotion of recommended agriculture techn ologies and package of practice. The demonstrations, introduction of new seed varieties, farm machines & implements, nutri ents, pesticides and knowledge based intervention s developed for different agro -climatic zones are promoted. During 2013 -14, based on the experience of implementation the intervention of Marketing Support including post harvest technology was also included. From the year 2015 -16, the programme has been modified including the few interventions like seed distribution of rice, see d production incentive for newer varieties/hybrids of rice, micro - nutrients, soil ameliorants and plant protection chemicals, machines like laser land levelers, etc. Financial status: Year -wise allocation and release of funds under BGREI are as under: Rs. in crore Sl No Year Allocation (central share) Release (Central Share) Expenditure (Central Share) 1 2012 -13 1000.00 998.03 997.790 2 2013 -14 1000.00 623.57 620.420 3 2014 -15 1000.00 845.84 793.49 4 2015 -16 500.00 397.11 376.010 5 2016 -17 630.00 553.54 Annexure -I Country wise Area, Production and Yield of Total Rice during 2010 -11 to 201 3-14 A - Area in million hectares P - Production in million tonnes Y - Yield in kg/ha Country 2010 -11 2011 -12 2012 -13 2013 -14 A P Y A P Y A P Y A P Y India 36.95 12.06 326 43.97 65.74 1495 42.41 157.80 3721 43.94 159.20 3623 China 30.12 197.21 6548 30.31 202.67 6686 30.40 205.94 6775 30.58 205.21 6710 Bangladesh 11.80 49.36 4183 12.00 50.63 4219 11.42 50.50 4421 11.77 51.50 4376 Indonesia 13.24 66.41 5014 13.20 65.74 4980 13.45 69.06 5136 13.84 71.28 5152 Thailand 10.99 31.60 2875 11.63 34.59 2974 12.28 37.47 3051 12.37 36.06 2915 Vietnam 7.51 39.99 5322 7.66 42.40 5539 7.75 43.66 5632 7.90 44.04 5572 Myanmar 8.05 33.20 4124 7.57 29.01 3834 8.15 28.08 3445 7.50 28.77 3836 Philippines 4.35 15.77 3622 4.54 16.68 3677 4.69 18.03 3845 4.75 18.44 3885 Japan 1.63 10.60 6511 1.58 8.40 5331 1.58 10.65 6739 1.60 10.76 6728 Brazil 2.72 11.24 4127 2.75 13.48 4895 2.41 11.55 4787 2.35 11.78 5008 Total 127.37 467.44 3670 135.20 529.34 3915 134.54 632.74 4703 136.60 637.04 4663 Source: Agricultural Statistics at a glance 2015 Annexure -II",
  "7.75 43.66 5632 7.90 44.04 5572 Myanmar 8.05 33.20 4124 7.57 29.01 3834 8.15 28.08 3445 7.50 28.77 3836 Philippines 4.35 15.77 3622 4.54 16.68 3677 4.69 18.03 3845 4.75 18.44 3885 Japan 1.63 10.60 6511 1.58 8.40 5331 1.58 10.65 6739 1.60 10.76 6728 Brazil 2.72 11.24 4127 2.75 13.48 4895 2.41 11.55 4787 2.35 11.78 5008 Total 127.37 467.44 3670 135.20 529.34 3915 134.54 632.74 4703 136.60 637.04 4663 Source: Agricultural Statistics at a glance 2015 Annexure -II Sate wise Area, Production and Yield of Rice during 2010 -11 to 2014 -15 A - Area in million hectares , P - Production in million tonnes , Y - Yield in kg/ha 2010 -11 2011 -12 2012 -13 2013 -14 2014 -15 Sl. No. State A P Y A P Y A P Y A P Y A P Y 1 Andhra Pradesh 2.77 7.88 284 3 2.35 7.75 3302 2.21 6.86 3106 2.44 6.97 2852 2.39 7.23 3022 2 Arunachal Pradesh 0.12 0.23 192 5 0.12 0.26 2065 0.13 0.26 2086 0.13 0.28 2092 0.13 0.29 2241 3 Assam 2.57 4.74 184 3 2.54 4.52 1843 2.49 5.13 2061 2.45 4.93 2012 2.50 5.22 2093 4 Bihar 2.83 3.10 109 5 3.32 7.16 1095 3.30 7.53 2282 3.13 5.51 1759 3.26 6.36 1948 5 Chattisgarh 3.70 6.16 166 3 3.77 6.03 1597 3.78 6.61 1746 3.80 6.72 1766 3.81 6.32 1660 6 Gujarat 0.81 1.50 185 2 0.84 1.79 2141 0.84 1.54 1843 0.79 1.64 2076 1.50 1.83 1223 7 Himachal Pradesh 0.08 0.13 167 3 0.08 0.13 1705 0.08 0.13 1629 0.07 0.12 1625 0.13 0.13 971 8 Jammu & Kashmir 0.26 0.51 194 2 0.26 0.54 2079 0.26 0.82 3126 0.27 0.61 2250 0.51 0.52 1019 9 Jharkhand 0.72 1.11 154 1 1.47 3.13 2131 1.41 3.16 2237 1.26 2.81 2238 1.11 3.36 3028 10 Karnataka 1.54 8.19 531 7 1.42 3.96 2793 1.28 3.36 2632 1.34 3.57 2666 1.33 3.54 2670 11 Kerala 0.21 0.52 245 2 0.21 0.57 2733 0.20 0.51 2577 0.20 0.51 2551 0.20 0.56 2836 12 Madhya Pradesh 1.60 1.77 110 6 1.66 2.23 1340 1.88 2.77 1474 1.93 2.84 1474 2.15 3.63 1684 13 Maharashtra 1.52 2.70 177 6 1.54 2.84 1841 1.56 3.06 1963 1.61 3.12 1934 1.55 2.95 1899 14 Manipur 0.21 0.52 245 3 0.22 0.59 2453 0.12 0.26 2099 0.22 0.40 1788 0.22 0.33 1488 15",
  "1.34 3.57 2666 1.33 3.54 2670 11 Kerala 0.21 0.52 245 2 0.21 0.57 2733 0.20 0.51 2577 0.20 0.51 2551 0.20 0.56 2836 12 Madhya Pradesh 1.60 1.77 110 6 1.66 2.23 1340 1.88 2.77 1474 1.93 2.84 1474 2.15 3.63 1684 13 Maharashtra 1.52 2.70 177 6 1.54 2.84 1841 1.56 3.06 1963 1.61 3.12 1934 1.55 2.95 1899 14 Manipur 0.21 0.52 245 3 0.22 0.59 2453 0.12 0.26 2099 0.22 0.40 1788 0.22 0.33 1488 15 Meghalaya 0.11 0.21 191 1 0.11 0.22 1988 0.11 0.23 2125 0.11 0.27 2493 0.11 0.30 2703 16 Mizoram 0.04 0.05 116 0 0.04 0.05 1411 0.01 0.03 2088 0.04 0.06 1522 0.04 0.06 1643 17 Nagaland 0.18 0.38 210 3 0.18 0.38 2106 0.18 0.41 2210 0.19 0.43 2267 0.20 0.45 2326 18 Odisha 4.23 6.83 161 6 4.00 5.81 1450 4.02 7.30 1814 4.18 7.61 1821 4.17 8.30 1992 19 Sikkim 0.01 0.02 172 7 0.01 0.02 1730 0.01 0.02 1768 0.01 0.02 1815 0.01 0.02 1818 20 Tamil Nadu 1.91 5.79 304 0 1.90 7.46 3918 1.90 4.05 2127 1.73 5.35 3100 1.80 5.73 3191 21 Telangana 1.98 6.54 330 3 1.75 5.15 2942 1.75 4.65 2656 1.91 5.75 3009 1.42 4.44 3138 22 Tripura 0.26 0.70 265 5 0.27 0.72 2700 0.27 0.71 2681 0.25 0.71 2800 0.26 0.75 2903 23 Uttar Pradesh 5.66 11.99 212 0 5.95 0.55 2358 5.95 14.42 2424 5.98 14.64 2447 5.87 12.17 2072 24 UttaraKhand 0.29 0.55 190 1 0.28 0.59 2121 0.28 0.58 2071 0.25 0.58 2289 0.26 0.60 2307 25 West Bengal 4.94 13.05 263 9 5.43 14.61 2688 5.43 15.02 2765 5.51 15.37 2788 5.38 14.68 2730 Total of NFSM State 38.56 85.16 220 8 39.73 77.04 1939 39.46 89.42 2266 39.8 2 90.82 2281 40.2 8 89.76 2228 All India 42.86 95.97 223 9 44.01 105.3 0 2393 42.75 105.2 4 2462 44.1 4 106.6 5 2416 44.1 1 105.4 8 2391 Source : Agricultural Statistics at a glance 2015 Annexure -III Export of Basmati and Non Basmati Rice during 2010 -11 to 2016 -17 Quantity in thousand tonnes Value Rs in crore Year Basmati Non Basmati Total Quantity Value Quantity Value Quantity Value 2010 -11 2370.68 11354.77 100.68 231.29 2471.36 11586.06 2011 -12 3178.18 15449.60 3997.72 8659.13 7175.90 24108.73 2012 -13 3459.89 19409.39 6688.00 14448.81 10147.89 33858.20 2013 -14 3754.09 29291.82 7136.14 17795.21 10890.23 47087.03",
  "2416 44.1 1 105.4 8 2391 Source : Agricultural Statistics at a glance 2015 Annexure -III Export of Basmati and Non Basmati Rice during 2010 -11 to 2016 -17 Quantity in thousand tonnes Value Rs in crore Year Basmati Non Basmati Total Quantity Value Quantity Value Quantity Value 2010 -11 2370.68 11354.77 100.68 231.29 2471.36 11586.06 2011 -12 3178.18 15449.60 3997.72 8659.13 7175.90 24108.73 2012 -13 3459.89 19409.39 6688.00 14448.81 10147.89 33858.20 2013 -14 3754.09 29291.82 7136.14 17795.21 10890.23 47087.03 2014 -15 3702.26 27598.71 8225.53 20336.00 11927.79 47934.71 2015 -16 4044.83 22714.30 6374.40 15085.90 10419.20 37800.20 2016 -17 ( upto Jan 2017 3252.00 17204.00 5215.00 13351.00 8467.00 30555.00 Source: Agricultural Statistics at a glance ,Custom & DGCIS 2015 & information collected from trade Division Annexure -IV Import of Basmati and Non Basmati Rice during 2010 -11 to 2016 -17 Quantity in thousand tonnes Value Rs in crore Year Basmati Non Basmati Total Quantity Value Quantity Value Quantity Value 2010 -11 0.00 0.00 0.22 1.12 0.22 1.12 2011 -12 0.46 2.47 1.06 5.48 1.52 7.95 2012 -13 0.00 0.00 0.72 1.44 0.72 1.44 2013 -14 0.00 0.00 8.29 8.29 8.29 8.29 2014 -15 0.00 0.00 1.96 10.83 1.96 10.83 2015 -16 0 0 1.02 5.91 1.02 5.91 2016 -17 (upto Jan 2017) 0 0 0.01 6.00 0.01 6.00 Source: Agricultural Statistics at a glance ,Custom & DGCIS 2015 & information collected from trade Division Annexure V Release and expenditure of funds of States under NFSM -Rice Rs. In Crore Sl. States 2012 -13 2013 -14 2014 -15 2015 -16 2016 -17 Rel. Exp. Rel. Exp. Rel. Exp. Rel. Exp. Rel. Exp. 1 Andhra Pradesh 43.10 44.33 46.75 41.56 24.15 25.13 12.47 9.79 9.39 8.76 2 Arunachal Pradesh 10.33 5.17 11.32 9.47 5.76 12.77 3.68 1.83 0.00 1.16 3 Assam 26.56 40.25 54.49 65.45 77.36 65.21 38.21 25.04 0.17 21.11 4 Bihar 21.91 19.25 2.64 16.18 26.35 35.63 22.07 5.45 13.69 13.14 5 Chhattisgarh 30.48 24.34 41.22 37.38 25.75 46.39 18.06 15.71 24.09 12.80 6 Gujarat* 2.43 1.90 2.40 2.05 0.20 0.04 0.45 0.40 2.77 0.80 7 Himachal Pradesh 4.95 4.44 4.83 4.83 1.97 1.98 0.83 0.83 1.22 0.99 8 J & K 1.24 2.90 3.50 2.64 2.72 3.99 1.49 1.37 2.00 1.45 9 Jharkhand 5.86 9.80 13.31 12.22 8.22 6.92 7.85 6.32 4.96 4.23 10 Karnataka 3.90 9.04 9.86 9.47 15.17 14.85 3.59 3.18 9.60 5.92 11 Kerala 1.37 2.15 0.89",
  "5 Chhattisgarh 30.48 24.34 41.22 37.38 25.75 46.39 18.06 15.71 24.09 12.80 6 Gujarat* 2.43 1.90 2.40 2.05 0.20 0.04 0.45 0.40 2.77 0.80 7 Himachal Pradesh 4.95 4.44 4.83 4.83 1.97 1.98 0.83 0.83 1.22 0.99 8 J & K 1.24 2.90 3.50 2.64 2.72 3.99 1.49 1.37 2.00 1.45 9 Jharkhand 5.86 9.80 13.31 12.22 8.22 6.92 7.85 6.32 4.96 4.23 10 Karnataka 3.90 9.04 9.86 9.47 15.17 14.85 3.59 3.18 9.60 5.92 11 Kerala 1.37 2.15 0.89 1.10 3.13 2.84 0.76 0.00 0.00 0.00 12 Madhya Pradesh 12.02 12.31 13.50 12.49 11.81 6.08 4.80 4.86 3.09 0.00 13 Maharashtra 26.51 24.38 26.59 26.03 27.90 39.16 11.17 10.96 5.78 4.56 14 Manipur 12.16 12.16 26.00 25.42 13.20 13.78 5.53 5.53 1.81 0.00 15 Meghalaya 9.30 8.81 12.31 12.45 7.83 8.24 3.58 3.32 1.14 0.00 16 Mizoram 6.04 6.04 7.50 7.50 4.33 4.33 0.67 0.67 0.28 0.00 17 Nagaland 11.64 11.64 20.00 19.46 10.79 11.51 2.45 2.45 2.90 2.90 18 Orissa 39.64 38.23 35.94 25.35 22.11 34.80 28.77 28.77 15.17 9.31 19 Sikkim 2.08 1.71 2.12 2.15 0.71 1.12 0.14 0.14 0.13 0.00 20 Tamil Nadu 19.10 21.50 19.50 23.80 26.38 27.31 15.06 14.84 11.49 5.21 21 Telangana 24.98 21.32 8.50 8.96 5.70 2.70 22 Tripura 21.84 21.84 34.09 34.65 25.18 26.28 12.38 12.38 2.70 2.70 23 Uttar Pradesh 72.15 67.70 56.44 69.02 62.89 60.26 25.55 19.99 17.04 14.39 24 Uttarakhand 12.44 7.97 10.39 9.66 2.12 1.80 1.55 1.81 2.16 1.71 25 West Bengal 28.40 26.02 39.41 33.98 31.73 43.16 24.46 24.46 39.75 18.04 Total 425.45 423.88 495.00 504.31 462.74 514.90 254.07 209.06 177.03 131.88 Annexure VI State-wise Procurement of Rice (According to Marketing Year) Sl. States 2012 -13 2013 -14 2014 -15 2015 -16 1 Punjab 8558 8106 7786 8113 2 Haryana 2609 2406 2015 2754 3 Uttar Pradesh 2286 1127 1698 150 4 Andhra Pradesh 6464 3737 3587 5 Telangana 4353 3504 135 6 Madhya Pradesh 898 1045 807 7 Odisha 3613 2801 3487 8 Tamil Nadu 481 684 1051 9 West Bengal 1766 1359 2031 10 Chhattisgarh 4804 4290 3423 11 Uttarakhand 497 463 465 35 12 Others 2044 1474 2307 84 All-India 34044 31845 32161 11271",
  "1045 807 7 Odisha 3613 2801 3487 8 Tamil Nadu 481 684 1051 9 West Bengal 1766 1359 2031 10 Chhattisgarh 4804 4290 3423 11 Uttarakhand 497 463 465 35 12 Others 2044 1474 2307 84 All-India 34044 31845 32161 11271"
]