[
  "January–February 2023 39 VeGeTaBleS play a major role in indian agriculture as they ensure the food and nutritional security of the country apart from enhancing per capita income of the farmers. Globally, india ranks second in vegetable production and contributes 16.70% to the global vegetable area and 15.40% to production. T omato, brinjal, cabbage, cauliflower, okra, beans and cucurbits are important vegetables cultivated in i ndia. among different vegetables grown in the country, tomato ranks third in priority after potato and onion. T omato ( Lycopersicon esculentum l.; Family Solanaceae) is one of the most important vegetable crops of india. T omato is grown in a wide range of climatic conditions across different states of i ndia. The major tomato producing states in the country are Madhya Pradesh, andhra Pradesh, Karnataka, Gujarat, Odisha, Chhattisgarh, West Bengal, Tamil n adu, Bihar, Maharashtra, Uttar Pradesh, Haryana and T elangana. These states account for about 90% of the total production in the country. insect pests and diseases are biotic constraints to tomato production. any part of the tomato plant may be affected by insect pests and diseases, thereby playing a significant role in determining quantity and quality of harvest. The important pests which are found to be severe menace in tomato production are given in Table1. Economic loss due to pests in tomato in recent past, with changes in the cropping pattern, ecosystems and habitat, climate and wider use of high input intensive vegetable varieties/hybrids, there has been a paradigm shift in infestation of pests in time and space. These pests cause huge losses depending upon the integrated pest management approaches against major insect pests and diseases of tomatoRaghavendra K V* Rekha Balodi and Subhash Chander infestation severity. if we look at the severity of damage, tomato fruit borer (H. armigera) alone causes 85-93.7% loss South american tomato pinworm (Tuta absoluta,) 60.08% to 82.31%; e arly blight (Alternaria solani ) up to 78%; Wilt ( Fusarium oxysporum f. sp. Lycopersici) 10-60%; Begomoviruses 100%; root knot nematode ( Meloidogyne spp) 27 .2% damage to tomato. Need for integrated approaches Management of these pests needs a comprehensive approach by integrating all ecologically feasible methods in crop protection. Farmers use pesticides as first line of defense and frequently resort to indiscriminate and non-judicious use of pesticides. From the base line survey conducted by iCar– nCiPM, new Delhi, it was found that, farmers spray 25-30 rounds of",
  "Wilt ( Fusarium oxysporum f. sp. Lycopersici) 10-60%; Begomoviruses 100%; root knot nematode ( Meloidogyne spp) 27 .2% damage to tomato. Need for integrated approaches Management of these pests needs a comprehensive approach by integrating all ecologically feasible methods in crop protection. Farmers use pesticides as first line of defense and frequently resort to indiscriminate and non-judicious use of pesticides. From the base line survey conducted by iCar– nCiPM, new Delhi, it was found that, farmers spray 25-30 rounds of cocktail chemical pesticides in a season. The major investment in tomato crop production was thus for plant protection activities and they spend nearly up to one lakh rupees for plant protection measures per season, which ultimately increases the cost of production. However literature states that pesticide application often exceeded 50 sprays per tomato crop season in south i ndia. Due to scarcity of information and lack of knowledge among the farmers about the recommended pesticides, dosage, safe harvest interval, label claim and personnel protection during spray operation, farmers go for indiscreet use of chemical pesticides which leads to several problems such as environmental pollution, pesticide residue in the harvested products, development of resistance/resurgence in pests, emergence of new pests, destruction of natural enemies and pollinators, and increased cost of production. in Research Tomato is one of the most important vegetable crops of i ndia, grown in 789.20 thousand ha area with 25.00 mt/ha productivity. Pests and diseases are biotic constraints to tomato production. in recent past, due to climate variability coupled with changes in the cropping pattern, there has been a paradigm shift in infestation of pests in time and space, causing huge losses. According to base line survey conducted by iCAR–NC iPM, New Delhi, farmers spray 25-30 rounds of cocktail chemical pesticides in a season, leading to various adverse effects. The only alternative to overcome the problems due to sole dependence on pesticides is to adopt integrated Pest Management ( iPM) practices as explained in this article. Besides guiding the farmers to reduce the over-reliance upon chemical pesticides, this will help them to grow tomatoes according to Good Agriculture Practices (GAP) standards.Indian Horticulture 40this circumstance, a paradigm shift in pest management approaches is the need of the hour and this can be effectively achieved through rationalization of pesticide use and integration of several eco-friendly approaches to minimize over-reliance on pesticides. Importance of Integrated Pest Management strategies in tomato production,",
  "( iPM) practices as explained in this article. Besides guiding the farmers to reduce the over-reliance upon chemical pesticides, this will help them to grow tomatoes according to Good Agriculture Practices (GAP) standards.Indian Horticulture 40this circumstance, a paradigm shift in pest management approaches is the need of the hour and this can be effectively achieved through rationalization of pesticide use and integration of several eco-friendly approaches to minimize over-reliance on pesticides. Importance of Integrated Pest Management strategies in tomato production, farmers practice calendar based application of pesticides. This has become a common practice over the years by most of the farmers growing tomatoes in almost all the states. it is in this contexts integrated Pest Management ( iPM) can play a major role in judicious use of pesticides, reducing cost of production and increased crop yield. integrated Pest Management (i PM) means the careful consideration of all available pest control techniques and subsequent integration of appropriate measures that discourage the development of pest populations and keep pesticides and other interventions to levels that are economically justified and reduce or minimize risks to human health and/or the environment. integrated pest management (i PM) practices consisting of growing resistant/tolerant varieties/hybrids/genotypes, cultural practices, mechanical practices, bio-control agents, botanicals and chemical pesticides (with appropriate dose and time of application) in an integrated manner to manage the pests and diseases will not only help the farmers to reduce the over-reliance upon chemical pesticides, but also help them to grow the tomatoes according to Good agriculture Practices (GaP) standards, which in turn attracts foreign export as well as domestic consumption and as number of insecticide sprays are reduced, the cost of production will also be reduced. iPM is not only cost effective but also economically and ecologically feasible and can be well accepted by the farming community. Synthesis of deliverable IPM technology in tomato Keeping in view the need for i PM approaches for pest management in tomato extensive literature survey both at n ational and international levels was done by iCar–national research Centre for integrated Pest Management, n ew Delhi and synthesized the i PM interventions furnished below. These interventions are being validated at two different agro-ecological regions of india. Synthesized deliverable IPM technology in tomato yavoid growing tomato crop in the same field season Table 1. Important insect and non-insect pests of Tomato S.No. Common name Scientific name insect-Pests 1 South American tomato pinworm",
  "in tomato extensive literature survey both at n ational and international levels was done by iCar–national research Centre for integrated Pest Management, n ew Delhi and synthesized the i PM interventions furnished below. These interventions are being validated at two different agro-ecological regions of india. Synthesized deliverable IPM technology in tomato yavoid growing tomato crop in the same field season Table 1. Important insect and non-insect pests of Tomato S.No. Common name Scientific name insect-Pests 1 South American tomato pinworm Tuta absoluta (Lepidoptera: Gelechiidae) 2 Tomato Fruit borer Helicoverpa armigera (Lepidoptera: Noctuidae) 3 Serpentine leaf miner Liriomyza trifolii (Diptera: Agromyzidae) 4 Leaf eating caterpillar Spodoptera litura (Lepidoptera: Noctuidae) 5 Fruit fly Zeugodacus cucurbitae / Bactrocerca cucurbitae (Diptera: Tephritidae) 6 Whitefly Bemisia tabaci (Hemiptera: Aleyrodidae) 7 Thrips Thrips tabaci; Frankliniella schultzei (Thysanoptera: Thripidae) 8 Aphids Myzus persicae and Aphis gossypii (Hemiptera: Aphididae) 9 Mealybugs Maconellicoccus hirsutus, Phenacoccus solenopsis and Paracoccus marginatus (Hemiptera: Pseudococcidae) Non-insect Pests 10 Red spider mite Tetranychus spp. (Acarina: Tetranychidae) 11 Root Knot Nematode Meloidogyne spp. (Tylenchida: Heteroderidae) 12 Reniform nematode Rotylenchulus reniformis (Tylenchida: Hoplolaimidae) Table 2. Important diseases of Tomato S.No. Disease Causal organism 1 Late blight Phytophthora infestans 2 Early blight Alternaria solani, A. alternata f.sp. lycopersici 3 Fusarium wilt Fusarium oxysporum f. sp. lycopersici 4 Bacterial wilt Ralstonia solanacearum 5 Damping off Pythium aphanidermatum 6 Bacterial fruits and leaf spots Xanthomonas campestris pv. vesicatoria 7 Bacterial stem and fruit canker Clavibacter michiganensis subsp. michiganensis 8 Septoria leaf spot Septoria lycopersici 9 Powdery mildew Oidium sp. and Oidiopsis sp. 10 Tomato leaf curl diseaseTomato leaf curl virus (ToLCV) 11 Tomato mosaic disease Tomato mosaic virus 12 Tomato spotted wilt disease Peanut bud necrosis virus (PbNV) TSWVJanuary–February 2023 41after season. Follow crop rotation with non-host crops such as cereals and legumes. a void growing of solanaceous crops such as chili and brinjal, after tomato, to avoid the carry-over of pests and diseases from one season to the other (e.g. bacterial wilt, early blight and nematodes). yDeep summer ploughing to expose soil borne pathogens and insect pupae to sunlight and natural enemies. ySeed treatment with ii Hr patented Organic Formulation (talc formulation of Pseudomonas fluorescens + Trichoderma harzianum) @ 15- 20 g/kg of seeds or Trichoderma viride or Pseudomonas fluorescens @ 200 g/ kg of seeds and shade-dried for half an hour before sowing against soil and seed borne fungal diseases and nematodes. ySeedlings treatment with bio-control agents,",
  "other (e.g. bacterial wilt, early blight and nematodes). yDeep summer ploughing to expose soil borne pathogens and insect pupae to sunlight and natural enemies. ySeed treatment with ii Hr patented Organic Formulation (talc formulation of Pseudomonas fluorescens + Trichoderma harzianum) @ 15- 20 g/kg of seeds or Trichoderma viride or Pseudomonas fluorescens @ 200 g/ kg of seeds and shade-dried for half an hour before sowing against soil and seed borne fungal diseases and nematodes. ySeedlings treatment with bio-control agents, fungicides and insecticides before transplanting. Dip the seedlings first in the bio-control solution, i.e. ii Hr patented organic formulation (talc formulation of Pseudomonas fluorescens + Trichoderma harzianum) @ 5 g/litre or Trichoderma viride or Pseudomonas fluorescens @ 5 g/litre or 5 ml/litre for 10-15 min. after that, dip them again in insecticide + fungicide solution (Thiamethoxam 25 WG + Captan 75% WP @ 1g/ l Copper Oxychloride @ 2.5 g/ l) against bacterial leaf spot, fungal diseases and nematodes and then transplant after 10-15 minutes. yUse of 100-mesh nylon net in nursery beds to avoid entry of whitefly and transmission of leaf curl disease in tomato. yapplication of well decomposed enriched farmyard manure @ 2 t/ha, enriched with Trichoderma viride or Pseudomonas fluorescens @ 2 kg/t of well decomposed FYM against fungal diseases and nematodes. ySoil application of 500 kg of n eem cake against bacterial wilt, serpentine leaf miner and root knot nematodes and 1 tonne of vermin-compost per hectare to the main field before transplanting (induced resistance against biotic stress – pest incidence). yPlastic mulching to reduce pupation in the soil, repels whiteflies in case of silver coloured sheets and also avoids weed growth. Polythene sheets of 25-30 micron thickness (black or silver coloured) should be spread on the raised beds as mulch before transplanting. round holes should be made as per the recommended spacing (4 ft × 1.5 ft or 120 cm × 45 cm) using a punch or a large diameter pipe and a hammer and the seedlings should be placed in the holes. yintercropping a tall variety of marigold as a trap crop @ 16:1 ratio. Plant 45 days old marigold seedlings and 25 days old tomato seedlings to synchronize flowering in both the crops. eggs and larvae are manually collected and destructed from field along with the flowers. This trap cropping system also helps in reducing the root knot nematode infestation. yGrowing 5-6 rows",
  "punch or a large diameter pipe and a hammer and the seedlings should be placed in the holes. yintercropping a tall variety of marigold as a trap crop @ 16:1 ratio. Plant 45 days old marigold seedlings and 25 days old tomato seedlings to synchronize flowering in both the crops. eggs and larvae are manually collected and destructed from field along with the flowers. This trap cropping system also helps in reducing the root knot nematode infestation. yGrowing 5-6 rows of sorghum or maize all around tomato field at least 2 months before transplanting as a barrier crop against sucking pests like whiteflies, thrips and aphids. yinstall bird percher @ 15-20 bird perches (T shaped) per ha to attract insectivorous birds to feed on different stages of insect pests. yStaking tomato plants improves fruit quality by keeping plants and fruits off the ground and by providing better spray coverage. Staking tomatoes and using a system of drip irrigation will reduce leaf dampness, while allowing enough space for aeration. yinstallation of Y ellow sticky traps @ 10 traps/ha, 15 cm above the canopy against white fly and Blue sticky traps @ 10 traps/ha against thrips. locally available empty tins can be painted yellow or blue / coated with grease / vaseline/ castor oil on outer surface may also be used as yellow/blue sticky traps. yinstallation of specific lures in pheromone traps for South american tomato pinworm, fruit borer and tobacco/leaf eating caterpillar @ 10-12 traps/ha (replace the lures with fresh ones after every 2-3 weeks). Trap should be installed in the field in such a way that the position of the lure is always 2 to 3 feet above the crop canopy. The trapped moth should be collected and killed on regular intervals. yinstallation of indigenously prepared light trap by hanging one incandescent bulb @ one bulb on a tub of water. Such traps may be installed @ 2-3 traps/ha for monitoring and mass trapping of adult moths of South american tomato pinworm. yinstallation of fruit fly traps @ 20-25 traps/ha for monitoring and mass trapping of fruit flies. yreleasing of egg parasitoids Trichogramma achaea / Trichogramma pretiosum / Trichogrammatoidea bactrae at weekly intervals @ 50,000/ha for 6 times at an interval of 7 days against South american tomato pinworm. ySpraying of entomopathogens like Beauveria bassiana / Lecanicillium lecanii / Metarhizium anisopliae @ 1 × 10 8 cfu/ml against sucking pests.",
  "monitoring and mass trapping of adult moths of South american tomato pinworm. yinstallation of fruit fly traps @ 20-25 traps/ha for monitoring and mass trapping of fruit flies. yreleasing of egg parasitoids Trichogramma achaea / Trichogramma pretiosum / Trichogrammatoidea bactrae at weekly intervals @ 50,000/ha for 6 times at an interval of 7 days against South american tomato pinworm. ySpraying of entomopathogens like Beauveria bassiana / Lecanicillium lecanii / Metarhizium anisopliae @ 1 × 10 8 cfu/ml against sucking pests. Spraying of Bacillus thuringiensis var. kurstaki @ 500 g/ha against lepidopteran pests. Spraying of Ha/Sl n PV 250 le with 1% jaggery at 28, 35 and 42 days after transplanting in the evening hours against fruit borers, and leaf eating caterpillar. ySpraying of n eem oil (a zadirachtin 5% e C) @ 2 ml/ litre is effective against fruit borer, defoliators and sucking pests. yMechanical collection and destruction of lepidopteran larvae at periodic intervals (3-4 times) for management of fruit borer and defoliator. Collection and destruction of infected leaves, shoots and fruits to reduce the spread of diseases. yremove the infected plants and drench the soil with captan 50% WP @ 1 g/litre against Sclerotium rot and Fusarium wilt. ySpraying of need based label claim pesticides. Evaluation of adaptable IPM technology in tomato under wide area approach The validation of thus synthesized deliverable Indian Horticulture 42Table 3. List of label claim pesticides (Source : Central Insecticide Board and Registration Committee) S.No. Pesticide and recommended dose Target pest 1 Indoxacarb 14.5% SC @ 0.8 ml/litre South American pin worm and Tomato fruit borer 2 Chlorantraniliprole 18.5% SC @ 0.25 ml/litre Tomato fruit borer 3 Thiomethoxam 25% WP @ 0.4 g/litre or Imidacloprid 17.80% SL @ 0.5 ml/litreWhitefly 4 Cyantraniliprole 10.26% OD @ 1.2 ml/litre South American pin worm, leaf miner, aphids, thrips, whitefly and fruit borer 5 Fenazaquin 10% EC @ 2.5 ml/lit or Spiromesifen 22.9% SC @ 1.5 ml/litre Red spider mite 6 Copper oxychloride 50% WP @ 2-3 g/litre Late and early blight, leaf spot and bacterial wilt 7 Carbendazim 50% WP @ 1 g/litre Fusarium wilt, Sclerotium rot and powdery mildew 8 Mancozeb @ 2 ml/litre Leaf spot, early and late blight 9 Tebuconazole 50% + Trifloxystrobin 25% WG @ 0.75 g/ L Early blight, leaf spot and late blight Note: Spray solution required per hectare in tomato crop = 500 litres. Damage symptoms of major insect pests",
  "spider mite 6 Copper oxychloride 50% WP @ 2-3 g/litre Late and early blight, leaf spot and bacterial wilt 7 Carbendazim 50% WP @ 1 g/litre Fusarium wilt, Sclerotium rot and powdery mildew 8 Mancozeb @ 2 ml/litre Leaf spot, early and late blight 9 Tebuconazole 50% + Trifloxystrobin 25% WG @ 0.75 g/ L Early blight, leaf spot and late blight Note: Spray solution required per hectare in tomato crop = 500 litres. Damage symptoms of major insect pests and diseases in Tomato IPM interventions in Tomato iPM technology in tomato was done by i Car – nCiPM, n ew Delhi in collaboration with Krishi Vigyan Kendra, Chintamani, University of agricultural Sciences, Bengaluru through farmers’ participatory approach (FP a) at Brahmanaradinne and Mudachintalahalli village of Chintamani taluk, Chikballapura district, Karnataka and at Padhana village of Karnal district, Haryana (area coverage – iPM 10 a c i.e. 10 farmers of 1 a c each and n on-iPM 5 ac i.e. 5 farmers of 1 a c each) during 2020-2021. The critical i PM inputs were provided to the selected i PM farmers and the i PM technology in tomato is being compared with the farmer’s practices. The main intention of iPM approaches in tomato is to promote need based application of pesticide spray, instead of calendar based and maintaining the productivity of the crop. in addition, awareness is being created through series of farmer field schools (FFS) among the farming community about the adoption and advantages of i PM technology in sustainable vegetable production. SUMMARY Due to i PM interventions in tomato, we succeeded in changing the farmers’ attitude towards need based pesticide application instead of practicing calendar based pesticide application, without hampering the productivity of the crop. The i PM approach in tomato resulted in reducing the total number of pesticide applications to 8-10 sprays instead of 20-24 sprays per season. The awareness created through series of farmer field schools (FFS) among the farming community about importance of iPM technology in sustainable vegetable production has also promoted adoption of Good agricultural Practices (GaP) by the farmers, through which they were able to produce residue free tomatoes and other vegetables for the market. For further interaction, please write to: Dr Raghavendra K V (Scientist), ICAR-National Research Centre for Integrated Pest Management, New Delhi 110 012 *Corresponding author email: raghavendra.kv@icar.gov.in",
  "schools (FFS) among the farming community about importance of iPM technology in sustainable vegetable production has also promoted adoption of Good agricultural Practices (GaP) by the farmers, through which they were able to produce residue free tomatoes and other vegetables for the market. For further interaction, please write to: Dr Raghavendra K V (Scientist), ICAR-National Research Centre for Integrated Pest Management, New Delhi 110 012 *Corresponding author email: raghavendra.kv@icar.gov.in"
]